-- phpMyAdmin SQL Dump
-- version 5.2.2
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: Mar 28, 2026 at 08:54 AM
-- Server version: 11.4.5-MariaDB-ubu2404
-- PHP Version: 7.4.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `DNS110_date`
--

-- --------------------------------------------------------

--
-- Table structure for table `categories`
--

CREATE TABLE `categories` (
  `id` int(11) NOT NULL,
  `name` varchar(100) NOT NULL,
  `label` varchar(255) DEFAULT NULL,
  `icon` varchar(50) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci ROW_FORMAT=DYNAMIC;

--
-- Dumping data for table `categories`
--

INSERT INTO `categories` (`id`, `name`, `label`, `icon`, `created_at`, `updated_at`) VALUES
(1, 'Network', 'شبکه', 'website.svg', '2025-10-30 09:59:52', '2025-11-20 09:12:01'),
(2, 'Windows', 'ویندوز', 'website.svg', '2025-11-06 08:32:45', '2025-11-20 09:12:07'),
(3, 'Camera', 'دوربین', 'website.svg', '2025-11-06 08:33:06', '2025-11-20 09:12:12'),
(4, 'Hardware', 'سخت افزار', 'website.svg', '2025-11-06 08:33:16', '2025-11-20 09:12:18'),
(5, 'Server', 'سرور', 'website.svg', '2025-11-06 08:33:24', '2025-11-20 09:12:24'),
(6, 'ThirdParty', 'ابزارها', 'website.svg', '2025-11-22 05:33:35', '2025-11-22 05:35:18'),
(7, '×lients', 'ابزار کلاینت', NULL, '2025-11-27 05:26:32', '2025-11-27 05:26:46'),
(8, 'Printer', 'چاپگر', NULL, '2025-12-16 08:41:45', '2025-12-16 08:41:45');

-- --------------------------------------------------------

--
-- Table structure for table `docs`
--

CREATE TABLE `docs` (
  `id` int(11) NOT NULL,
  `name` varchar(255) DEFAULT NULL,
  `realname` varchar(255) DEFAULT NULL,
  `size` varchar(255) DEFAULT NULL,
  `task_id` int(11) DEFAULT NULL,
  `created_at` datetime DEFAULT current_timestamp(),
  `updated_at` datetime DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci ROW_FORMAT=DYNAMIC;

--
-- Dumping data for table `docs`
--

INSERT INTO `docs` (`id`, `name`, `realname`, `size`, `task_id`, `created_at`, `updated_at`) VALUES
(131, '691991689a4ec', 'فرم درخواست برگشت كالا به انبار .pdf', '160684', 68, '2025-11-16 12:25:04', '2025-11-16 12:25:04'),
(132, '691aba150e121', 'Photo.txt', '167', 106, '2025-11-17 09:30:53', '2025-11-17 09:30:53'),
(134, '69423c430ba48', 'Screenshot 2025-12-17 084408.png', '266967', 155, '2025-12-17 08:44:43', '2025-12-17 08:44:43'),
(135, '695f9a09411e4', 'ciscoupdate.pdf', '625623', 163, '2026-01-08 15:20:33', '2026-01-08 15:20:33'),
(136, '696c7203b3a3b', 'چک لیست بعد از نصب ویندوز.xlsx', '11564', 164, '2026-01-18 09:09:15', '2026-01-18 09:09:15'),
(137, '6975ff2496371', 'تاریخ همداد(مهلت یکماهه).png', '69995', 167, '2026-01-25 15:01:48', '2026-01-25 15:01:48'),
(138, '69998e74cad26', 'static_IP.txt', '417', 172, '2026-02-21 14:22:36', '2026-02-21 14:22:36'),
(139, '69998fa549941', 'jitsisteps.txt', '1717', 173, '2026-02-21 14:27:41', '2026-02-21 14:27:41'),
(140, '69998fff9ee51', 'Self-Hosting Guide - Debian_Ubuntu server _ Jitsi Meet.pdf', '592169', 173, '2026-02-21 14:29:11', '2026-02-21 14:29:11'),
(141, '69999005bfafe', '123.txt', '1537', 173, '2026-02-21 14:29:17', '2026-02-21 14:29:17'),
(142, '6999905428915', 'troub1.mhtml', '1915882', 173, '2026-02-21 14:30:36', '2026-02-21 14:30:36'),
(143, '6999905d835ec', 'troub2.mhtml', '1501204', 173, '2026-02-21 14:30:45', '2026-02-21 14:30:45'),
(144, '699990662c504', 'troub3.mhtml', '3662543', 173, '2026-02-21 14:30:54', '2026-02-21 14:30:54'),
(145, '699991bbb7cbb', 'jvb.conf.txt', '1184', 173, '2026-02-21 14:36:35', '2026-02-21 14:36:35'),
(146, '69b294beaf583', 'static_IP.txt', '417', 177, '2026-03-12 13:56:06', '2026-03-12 13:56:06'),
(147, '69b2981d17767', 'lin.txt', '446', 178, '2026-03-12 14:10:29', '2026-03-12 14:10:29'),
(148, '69b29fb62b02b', 'dmvpn.txt', '1613', 181, '2026-03-12 14:42:54', '2026-03-12 14:42:54');

-- --------------------------------------------------------

--
-- Table structure for table `events`
--

CREATE TABLE `events` (
  `id` int(11) NOT NULL,
  `title` text NOT NULL,
  `calendar_type` enum('jalali','miladi','ghamari') NOT NULL,
  `month` int(11) NOT NULL,
  `day` int(11) NOT NULL,
  `text` text NOT NULL,
  `is_fixed` tinyint(1) NOT NULL,
  `is_global` date NOT NULL,
  `rep` enum('0','1','2','3') NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

-- --------------------------------------------------------

--
-- Table structure for table `hijri`
--

CREATE TABLE `hijri` (
  `id` int(11) NOT NULL,
  `holiday` varchar(255) DEFAULT NULL,
  `month` varchar(255) DEFAULT NULL,
  `day` varchar(255) DEFAULT NULL,
  `event` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci ROW_FORMAT=DYNAMIC;

--
-- Dumping data for table `hijri`
--

INSERT INTO `hijri` (`id`, `holiday`, `month`, `day`, `event`) VALUES
(1, NULL, '1', '1', 'آغاز سال قمری'),
(2, '1', '1', '9', 'تاسوعای حسینی (ع)'),
(3, '1', '1', '10', 'عاشورای حسینی (ع)'),
(4, NULL, '1', '12', 'شهادت امام زین العابدین (ع) (سال ۹۵ قمری)'),
(5, NULL, '1', '18', 'تغییر قبله از بیت المقدس به مکه (سال ۲ قمری)'),
(6, NULL, '1', '25', 'شهادت امام زین العابدین (ع) به روایتی (سال ۹۵ قمری)'),
(7, NULL, '1', '4', 'ولادت ابوالفضل العباس (ع) و روز جانباز[ ۴ شعبان ]'),
(8, NULL, '1', '5', 'ولادت امام زین العابدین (ع)[ ۵ شعبان ]'),
(9, NULL, '1', '11', 'ولادت علی اکبر (ع) و روز جوان[ ۱۱ شعبان ]'),
(10, NULL, '1', '15', 'ولادت حضرت قائم عجل الله تعالی فرجه و جشن نیمه شعبان[ ۱۵ شعبان ]'),
(11, '1', '2', '20', 'اربعین حسینی (ع)'),
(12, '1', '2', '28', 'رحلت پیامبر (ص) (سال ۱۱ قمری)، شهادت امام حسن مجتبی (ع) (سال ۵۰ قمری)'),
(13, NULL, '2', '30', 'شهادت امام رضا (ع) (سال ۲۰۳ قمری)'),
(14, NULL, '3', '1', 'هجرت پیامبر (ص) از مکه به مدینه (مبدا تاریخ هجری قمری)'),
(15, NULL, '3', '8', 'شهادت امام حسن عسگری (ع) (سال ۲۶۹ قمری)'),
(16, NULL, '3', '12', 'ولادت پیامبر (ص) به روایت اهل سنت (سال ۵۳ پیش از هجرت)'),
(17, '1', '3', '17', 'ولادت پیامبر (۲) به روایت شیعه (سال ۵۳ پیش از هجرت)، ولادت امام صادق (ع) (سال ۸۳ قمری)'),
(18, NULL, '4', '8', 'ولادت امام حسن عسگری (ع) (سال ۲۳۲ قمری)'),
(19, NULL, '4', '10', 'وفات حضرت معصومه (س) (سال ۲۰۱ قمری)'),
(20, NULL, '5', '5', 'ولادت حضرت زینب (س) روز پرستار (سال ۵ قمری)'),
(21, '1', '5', '13', 'شهادت حضرت فاطمه (س) به روایتی (سال ۱۱ هجری)'),
(22, NULL, '6', '3', 'شهادت حضرت فاطمه (س) به روایتی (سال ۱۱ هجری)'),
(23, NULL, '6', '20', 'ولادت حضرت فاطمه (س) و روز زن'),
(24, NULL, '7', '1', 'ولادت امام باقر (ع) (سال ۵۷ قمری)'),
(25, NULL, '7', '3', 'شهادت امام هادی (ع) (سال ۲۵۴ قمری)'),
(26, NULL, '7', '10', 'ولادت امام جواد (ع) (سال ۱۹۵ قمری)'),
(27, '1', '7', '13', 'ولادت امام علی (ع) روز مرد (سال ۲۳ قبل از هجرت)'),
(28, NULL, '7', '15', 'وفات حضرت زینب (س) (سال ۶۲ قمری)'),
(29, NULL, '7', '25', 'شهادت اما موسی کاظم (ع) (سال ۱۸۳ قمری)'),
(30, '1', '7', '27', 'مبعث پیامبر (ص) (سال ۱۳ قبل از هجرت)'),
(31, NULL, '8', '3', 'ولادت امام حسین (ع) (سال ۴ قمری)، روز پاسدار'),
(32, NULL, '8', '4', 'ولادت حضرت ابوالفضل (ع) (سال ۲۶ قمری)، روز جانباز'),
(33, NULL, '8', '5', 'ولادت امام زین العابدین (ع) (سال ۳۸ قمری)'),
(34, NULL, '8', '11', 'ولادت حضرت علی اکبر (ع) ( سال ۳۳ قمری)'),
(35, '1', '8', '15', 'ولادت حضرت مهدی (ع) (سال ۲۵۵ قمری)'),
(36, NULL, '9', '10', 'وفات حضرت خدیجه (س) (سال ۳ قبل از هجرت)'),
(37, NULL, '9', '15', 'ولادت امام حسن (ع) (سال ۳ قمری)'),
(38, NULL, '9', '18', 'شب قدر اول'),
(39, NULL, '9', '19', 'ضربت خوردن امام علی (ع) (سال ۴۰ قمری)'),
(40, NULL, '9', '20', 'شب قدر دوم'),
(41, '1', '9', '21', 'شهادت امام علی (ع) (سال ۴۰ قمری)'),
(42, NULL, '9', '22', 'شب قدر سوم'),
(43, '1', '10', '1', 'عید فطر'),
(44, '1', '10', '2', 'روز دوم عید فطر'),
(45, NULL, '10', '21', 'فتح اندلس به دست مسلمانان'),
(46, '1', '10', '25', 'شهادت امام صادق (سال ۱۴۸ قمری)'),
(47, NULL, '11', '1', 'ولادت حضرت معصومه (س) روز دختران (سال ۱۷۳ قمری)'),
(48, NULL, '11', '11', 'ولادت امام رضا (ع) (سال ۱۴۸ قمری)'),
(49, NULL, '11', '29', 'شهادت امام جواد (ع) (سال ۲۲۰ قمری)'),
(50, NULL, '12', '7', 'شهادت امام باقر (ع) (سال ۱۱۴ قمری)'),
(51, '1', '12', '10', 'عید قربان'),
(52, NULL, '12', '15', 'ولادت امام هادی (ع) (سال ۲۱۲ قمری)'),
(53, '1', '12', '18', 'عید غدیر (سال ۱۰ قمری)');

-- --------------------------------------------------------

--
-- Table structure for table `hijri_months`
--

CREATE TABLE `hijri_months` (
  `jalali_year` int(11) DEFAULT NULL,
  `year` int(11) DEFAULT NULL,
  `months` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci ROW_FORMAT=DYNAMIC;

--
-- Dumping data for table `hijri_months`
--

INSERT INTO `hijri_months` (`jalali_year`, `year`, `months`) VALUES
(1398, 1440, '[\"07-14\", 30, 29, 30, 30, 30, 29, 30, 30, 29, 29, 30, 29]'),
(1399, 1441, '[\"07-25\", 29, 30, 29, 30, 30, 29, 30, 30, 29, 30, 29, 30]'),
(1400, 1442, '[\"08-07\", 29, 29, 30, 29, 30, 29, 30, 30, 29, 30, 30, 29]'),
(1401, 1443, '[\"08-18\", 29, 30, 30, 29, 29, 30, 29, 30, 30, 29, 30, 29]'),
(1402, 1444, '[\"08-28\", 30, 30, 29, 30, 29, 29, 30, 29, 30, 29, 30, 29]'),
(1403, 1445, '[\"09-09\", 30, 30, 30, 29, 30, 29, 29, 30, 29, 30, 29, 29]'),
(1384, 1426, '[\"02-10\", 29, 29, 30, 29, 30, 30, 30, 29, 30, 30, 29, 29]'),
(1385, 1427, '[\"02-20\", 30, 29, 29, 30, 29, 30, 30, 30, 29, 30, 29, 29]'),
(1386, 1428, '[\"03-01\", 29, 30, 29, 29, 29, 30, 30, 29, 30, 30, 30, 29]'),
(1387, 1429, '[\"03-12\", 30, 29, 30, 29, 29, 29, 30, 30, 29, 30, 30, 29]'),
(1388, 1430, '[\"03-23\", 30, 30, 29, 29, 30, 29, 30, 29, 29, 30, 30, 29]'),
(1389, 1431, '[\"04-05\", 30, 30, 29, 30, 29, 30, 29, 30, 29, 29, 30, 29]'),
(1390, 1432, '[\"04-16\", 30, 30, 29, 30, 30, 30, 29, 30, 29, 29, 30, 29]'),
(1391, 1433, '[\"04-27\", 29, 30, 29, 30, 30, 30, 29, 30, 29, 30, 29, 30]'),
(1392, 1434, '[\"05-09\", 29, 29, 30, 29, 30, 30, 29, 30, 30, 29, 30, 29]'),
(1393, 1435, '[\"05-19\", 29, 30, 29, 30, 29, 30, 29, 30, 30, 30, 29, 30]'),
(1394, 1436, '[\"05-30\", 29, 30, 29, 29, 130, 29, 30, 29, 30, 29, 30, 30]'),
(1395, 1437, '[\"06-10\", 29, 30, 30, 29, 30, 29, 29, 30, 29, 29, 30, 30]'),
(1396, 1438, '[\"06-22\", 29, 30, 30, 30, 29, 30, 29, 29, 30, 29, 29, 30]'),
(1397, 1439, '[\"07-03\", 29, 30, 30, 30, 30, 29 ,30, 29, 29, 30, 29, 29]'),
(1404, 1446, '[\"09-20\", 30, 30, 30, 29, 30, 30, 29, 30, 29, 29, 29, 30]'),
(1405, 1447, '[\"10-01\", 29, 30, 30, 29, 30, 30, 30, 29, 30, 29, 29, 29]'),
(1406, 1448, '[\"10-12\", 30, 29, 30, 29, 30, 30, 30, 29, 30, 29, 29, 29]');

-- --------------------------------------------------------

--
-- Table structure for table `jalali`
--

CREATE TABLE `jalali` (
  `id` int(11) NOT NULL,
  `holiday` varchar(255) DEFAULT NULL,
  `month` varchar(255) DEFAULT NULL,
  `day` varchar(255) DEFAULT NULL,
  `event` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci ROW_FORMAT=DYNAMIC;

--
-- Dumping data for table `jalali`
--

INSERT INTO `jalali` (`id`, `holiday`, `month`, `day`, `event`) VALUES
(1, '1', '1', '1', 'جشن نوروز/جشن سال نو'),
(2, '1', '1', '2', 'عید نوروز'),
(3, '1', '1', '3', 'عید نوروز'),
(4, '1', '1', '4', 'عید نوروز'),
(5, NULL, '1', '6', 'روز امید، روز شادباش نویسی،زادروز اَشو زرتشت، اَبَراِنسان بزرگ تاریخ'),
(8, '1', '1', '12', 'روز جمهوری اسلامی'),
(9, '1', '1', '13', 'جشن سیزده به در روز طبیعت'),
(10, NULL, '1', '17', 'سروش روز،جشن سروشگان'),
(11, NULL, '1', '19', 'فروردین روز،جشن فروردینگان'),
(12, NULL, '1', '23', 'روز دندانپزشک'),
(13, NULL, '1', '25', 'روز بزرگداشت عطار نیشابوری'),
(14, NULL, '1', '29', 'روز ارتش جمهوری اسلامی ایران'),
(15, NULL, '1', '30', 'روز علوم آزمایشگاهی، زاد روز حکیم سید اسماعیل جرجانی'),
(17, NULL, '2', '1', 'روز بزرگداشت سعدی'),
(18, NULL, '2', '2', 'جشن گیاه آوری'),
(19, NULL, '2', '3', 'روزبزرگداشت شیخ بهایی؛ روزملی کارآفرینی؛ روز معماری'),
(20, NULL, '2', '6', 'فاجعه‌ی انفجارِ بندر عباس [ 1404 خورشیدی]'),
(21, NULL, '2', '9', 'روز ملی روانشناس و مشاور'),
(22, NULL, '2', '10', 'جشن چهلم نوروز؛ روز ملی خلیج فارس'),
(23, NULL, '2', '12', 'روز معلم'),
(24, NULL, '2', '15', 'جشن میانه بهار/جشن بهاربد؛ روز شیراز'),
(25, NULL, '2', '22', 'زادروز مریم میرزاخانی ریاضیدان ایرانی، روز جهانی زن در ریاضیات'),
(26, NULL, '2', '25', 'روز بزرگداشت فردوسی'),
(27, NULL, '2', '27', 'روز ارتباطات و روابط عمومی'),
(28, NULL, '2', '28', 'روز بزرگداشت حکیم عمر خیام'),
(29, NULL, '3', '1', 'روز بهره وری و بهینه سازی مصرف،روز بزرگداشت ملاصدرا'),
(31, NULL, '3', '2', 'فروریختن ساختمان متروپل در آبادان'),
(32, NULL, '3', '3', 'فتح خرمشهر در عملیات بیت المقدس و روز مقاومت، ایثار و پیروزی'),
(33, NULL, '3', '4', 'روز دزفول، روز مقاومت و پایداری'),
(34, NULL, '3', '6', 'خرداد  روز،جشنخرداد گان'),
(35, '1', '3', '14', 'رحلت حضرت امام خمینی'),
(36, '1', '3', '15', 'قیام 15خرداد'),
(37, NULL, '3', '25', 'روز ملی گل وگیاه'),
(38, NULL, '3', '31', 'سالروز زلزله رودبار و منجیل [1369خورشیدی]'),
(39, NULL, '4', '1', 'جشن آب پاشونک، جشن آغاز تابستان'),
(40, NULL, '4', '7', 'انفجار دفتر حزب جمهوری اسلامی؛ روز قوه قضاییه'),
(41, NULL, '4', '8', 'روز مبارزه با سلاح های شیمیایی و میکروبی'),
(43, NULL, '4', '10', 'روز صنعت و معدن،روز بزرگداشت صائب تبریزی،زادروز بابک خرمدین، سپه‌سالار دلاور ایران'),
(45, NULL, '4', '12', 'شلیک به پرواز 655 ایران ایر توسط ناو وینسنس [ 1367 خورشیدی ]'),
(46, NULL, '4', '13', 'جشنتیر گان، بزرگداشت کمان کشیدن جان‌فدای ایران، آرش کمانگیر بر فراز البرز'),
(47, NULL, '4', '14', 'روز قلم'),
(48, NULL, '4', '15', 'جشن خام خواری'),
(49, NULL, '4', '22', 'زادروز محمد خوارزمی، ریاضیدان و فیلسوف ایرانی و روز ملی فناوری اطلاعات'),
(50, NULL, '4', '25', 'روز بهزیستی و تامین اجتماعی'),
(51, NULL, '4', '27', 'اعلام پذیرش قطعنامه 598 شورای امنیت از سوی ایران [ 1367 خورشیدی ]'),
(52, NULL, '5', '7', 'اَمرداد  روز،جشناَمرداد گان'),
(53, NULL, '5', '8', 'روز بزرگداشت شیخ شهاب الدین سهروردی'),
(54, NULL, '5', '10', 'جشن چله تابستان'),
(55, NULL, '5', '14', 'سالروز صدور فرمان مشروطیت'),
(56, NULL, '5', '17', 'روز خبرنگار'),
(57, NULL, '5', '28', 'سالروز فاجعه آتش زدن سینما رکس آبادان ،سالروز وقایع ۲۸ مرداد پس از برکناری محمد مصدق‌السلطنه'),
(59, NULL, '6', '1', 'روز بزرگداشت ابوعلی سینا و روز پزشک'),
(60, NULL, '6', '2', 'آغاز هفته دولت'),
(61, NULL, '6', '3', 'هجرت پیامبر اکرم از مکه به مدینه[ ۱ ربیع الاول ]'),
(62, NULL, '6', '4', 'زادروز کوروش بزرگ ، شهریور روز،جشن شهریورگان'),
(64, NULL, '6', '5', 'روز بزرگداشت محمدبن زکریای رازی و روز داروساز'),
(65, NULL, '6', '8', 'انفجار در دفتر نخست‌وزیری جمهوری اسلامی ایران، روز مبارزه با تروریسم'),
(66, NULL, '6', '11', 'روزصنعت چاپ'),
(67, NULL, '6', '12', 'سالروز شهادت رئیسعلی دلواری، سردار بزرگ میهن و فرمانده قیام جنوب علیه اشغالگران انگلیسی'),
(68, NULL, '6', '13', 'روز بزرگداشت ابوریحان بیرونی'),
(69, NULL, '6', '21', 'روز سینما'),
(70, NULL, '6', '27', 'روز شعر و ادب پارسی و روز بزرگداشت استاد شهریار'),
(71, NULL, '6', '31', 'آغاز هفته دفاع مقدس'),
(72, NULL, '7', '1', 'آغاز حمله مغول به ایران در پاییز 598 خورشیدی'),
(73, NULL, '7', '4', 'روز گرامیداشت سربازان وطن'),
(75, NULL, '7', '7', 'سقوط هواپیمای حامل جمعی از فرماندهان جنگ (کلاهدوز، نامجو، فلاحی، فکوری، جهان آرا) در سال 1360 ، روز آتش نشانی و ایمنی'),
(77, NULL, '7', '8', 'روز بزرگداشت شمس تبریزی'),
(78, NULL, '7', '10', 'روزبزرگداشت مولوی'),
(79, NULL, '7', '14', 'مهر  روز،جشنمهر گان'),
(80, NULL, '7', '16', 'روز دامپزشکی'),
(81, NULL, '7', '20', 'روز ملی کودک'),
(82, NULL, '7', '21', 'روز بزرگداشت حافظ'),
(83, NULL, '7', '26', 'روز پیروزی کاوه و فریدون بر ضحاک'),
(84, NULL, '7', '28', 'روز تربیت بدنی و ورزش'),
(85, NULL, '7', '29', 'زادروز ستارخان ملقب به سردار ملی و از سرداران جنبش مشروطه ایران'),
(86, NULL, '8', '1', 'روز بزرگداشت ابوالفضل بیهقی، تاریخ‌نگار و نویسنده ایرانی،روز آمار و برنامه ریزی'),
(88, NULL, '8', '7', 'سالروز ورود کوروش بزرگ به بابل در سال 539 پیش از میلاد'),
(89, NULL, '8', '10', 'آبان  روز، جشن آبانگان'),
(90, NULL, '8', '13', 'روز دانش آموز'),
(91, NULL, '8', '14', 'روز ملّی مازندران'),
(92, NULL, '8', '15', 'جشن میانه پاییز'),
(93, NULL, '8', '18', 'روز ملی کیفیت'),
(94, NULL, '8', '24', 'روز کتاب و کتابخوانی'),
(95, NULL, '9', '1', 'آذر  جشن'),
(96, NULL, '9', '5', 'روز بسیج مستضعفان'),
(97, NULL, '9', '7', 'سالروز عملیات مروارید و روز نیروی دریایی'),
(98, NULL, '9', '9', 'جشنآذر گان ،آذر  روز'),
(99, NULL, '9', '13', 'روز بیمه'),
(100, NULL, '9', '15', 'روز حسابدار'),
(101, NULL, '9', '16', 'روز دانشجو'),
(102, NULL, '9', '21', 'سالروز نجاتآذر بایجان'),
(103, NULL, '9', '25', 'روز پژوهش و فنآوری'),
(104, NULL, '9', '30', 'جشن شب یلدا، شب چلّه'),
(105, NULL, '10', '1', 'روز میلاد خورشید؛ جشن خرم روز، نخستین جشندی گان'),
(106, NULL, '10', '5', 'سالروز شهادت اَشو زرتشت، اَبَراِنسان بزرگ تاریخ، زمین لرزه ی بم [1382 خورشیدی ]،سالروز عملیات کربلای 4 [1365 خورشیدی ]'),
(109, NULL, '10', '8', 'دی  به آذر روز، دومین جشندی گان،روز بزرگداشت یعقوب لیث صفاری (رادمان پورماهک) نخستین پادشاه ایرانی پس از اسلام'),
(111, NULL, '10', '9', 'اعدام میهن‌پرستان آذری در تبریز توسط قوای اشغالگر روس [1290 خورشیدی ]'),
(112, NULL, '10', '13', 'شهادت سردار حاج قاسم سلیمانی [1398 خورشیدی ]'),
(113, NULL, '10', '15', 'دی  به مهر روز، سومین جشندی گان'),
(114, NULL, '10', '16', 'غرق شدن کشتی سانچی [1396 خورشیدی ]'),
(115, NULL, '10', '18', 'شلیک به پرواز 752 هواپیمایی اوکراین [1398 خورشیدی ]'),
(116, NULL, '10', '19', 'درگذشت اکبر هاشمی رفسنجانی [1395 خورشیدی ]'),
(117, NULL, '10', '20', 'قتل امیرکبیر به دستور ناصرالدین شاه قاجار [1230 خورشیدی ]'),
(118, NULL, '10', '23', 'دی به دین روز، چهارمین جشن دیگان، زادروز محمدعلی جمال‌زاده (پدر داستان کوتاه ایران)'),
(119, NULL, '10', '30', 'آتش‌سوزی و فروریختن ساختمان پلاسکو [1395 خورشیدی ]'),
(120, NULL, '11', '1', 'زادروز فردوسی'),
(121, NULL, '11', '2', 'بهمن  روز، جشنبهمن گان'),
(122, NULL, '11', '5', 'جشن نوسره'),
(123, NULL, '11', '6', 'بزرگداشت صفی‌الدین اُرمَوی و روز موسیقی ایرانی'),
(124, NULL, '11', '10', 'جشن سده، گرامیداشتِ کشف آتش به دستِ هوشنگ شاه'),
(125, NULL, '11', '12', 'بازگشت امام خمینی (ره) به ایران'),
(126, NULL, '11', '15', 'جشن میانه زمستان'),
(127, NULL, '11', '19', 'روز نیروی هوایی'),
(128, '1', '11', '22', 'پیروزی انقلاب اسلامی'),
(129, NULL, '11', '29', 'جشن سپندارمذگان و روز عشق'),
(130, NULL, '11', '29', 'فاجعه انفجار قطار نیشابور [1382 خورشیدی]'),
(131, NULL, '12', '5', 'جشن سپندارمذگان و روز عشق'),
(132, NULL, '12', '5', 'روز بزرگداشت خواجه نصیر الدین طوسی و روز مهندس'),
(133, NULL, '12', '7', 'سالروز استقلال کانون وکلای دادگستری و روز وکیل مدافع'),
(134, NULL, '12', '15', 'روز درختکاری'),
(135, NULL, '12', '25', 'پایان سرایش شاهنامه،روز بزرگداشت اختر چرخ ادب پروین اعتصامی'),
(137, '1', '12', '29', 'روز ملی شدن صنعت نفت ایران');

-- --------------------------------------------------------

--
-- Table structure for table `jobs`
--

CREATE TABLE `jobs` (
  `id` int(11) NOT NULL,
  `name` varchar(255) DEFAULT NULL,
  `task_id` int(11) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci ROW_FORMAT=DYNAMIC;

--
-- Dumping data for table `jobs`
--

INSERT INTO `jobs` (`id`, `name`, `task_id`, `created_at`, `updated_at`) VALUES
(80, '111111', 15, '2025-11-09 12:15:52', '2025-11-09 12:15:52'),
(81, 'sssss', 15, '2025-11-09 12:16:07', '2025-11-09 12:16:07'),
(82, 'sssssssssssssss', 15, '2025-11-09 12:16:27', '2025-11-09 12:16:27'),
(83, 'sssssssssssssss', 15, '2025-11-09 12:16:33', '2025-11-09 12:16:33'),
(84, 'sssssssssssssss', 15, '2025-11-09 12:17:07', '2025-11-09 12:17:07'),
(85, 'ssssssssssssss', 15, '2025-11-09 12:17:13', '2025-11-09 12:17:13'),
(86, 'ssssssssssssss', 15, '2025-11-09 12:17:14', '2025-11-09 12:17:14'),
(87, 'ssssssssssss', 15, '2025-11-09 12:17:18', '2025-11-09 12:17:18'),
(88, 'ssssssssssssss', 15, '2025-11-09 12:17:29', '2025-11-09 12:17:29'),
(89, 'ssssssssssss', 15, '2025-11-09 12:17:32', '2025-11-09 12:17:32'),
(90, 'sssssssssss', 15, '2025-11-09 12:17:49', '2025-11-09 12:17:49'),
(91, 'sssssssssssss', 15, '2025-11-09 12:18:05', '2025-11-09 12:18:05'),
(92, 'ssssssssssssss', 15, '2025-11-09 12:18:11', '2025-11-09 12:18:11'),
(93, 'sssssssssssssssss', 15, '2025-11-09 12:18:22', '2025-11-09 12:18:22'),
(94, 'ssssssssssssssss', 15, '2025-11-09 12:18:30', '2025-11-09 12:18:30'),
(95, 'sssssssssssss', 15, '2025-11-09 12:18:39', '2025-11-09 12:18:39'),
(96, 'ssssssssss', 15, '2025-11-09 12:18:52', '2025-11-09 12:18:52'),
(97, 'ررررررررررررررر', 15, '2025-11-09 12:20:29', '2025-11-09 12:20:29'),
(98, 'ssssssssssssss', 15, '2025-11-09 12:20:39', '2025-11-09 12:20:39'),
(99, 'ssssssssssssssss', 15, '2025-11-09 12:20:54', '2025-11-09 12:20:54'),
(100, 'sssssssssssssss', 15, '2025-11-09 12:21:12', '2025-11-09 12:21:12'),
(101, 'eeeeeeee', 15, '2025-11-09 12:21:30', '2025-11-09 12:21:30'),
(102, 'sssssssss', 15, '2025-11-09 12:22:00', '2025-11-09 12:22:00'),
(103, 'sssssss', 15, '2025-11-09 12:23:02', '2025-11-09 12:23:02'),
(104, 'ssssssssssssss', 15, '2025-11-09 12:24:23', '2025-11-09 12:24:23'),
(105, 'ssssssss', 15, '2025-11-09 12:25:54', '2025-11-09 12:25:54'),
(107, 'eeeeeeeeee', 15, '2025-11-09 12:27:41', '2025-11-09 12:27:41'),
(108, 'ddddddddd', 15, '2025-11-09 12:28:06', '2025-11-09 12:28:06'),
(109, 'sssssssssssssss', 15, '2025-11-09 12:28:43', '2025-11-09 12:28:43'),
(110, 'sssssssssssssss', 15, '2025-11-09 12:36:55', '2025-11-09 12:36:55'),
(111, 'sssssssssssss', 15, '2025-11-09 12:37:01', '2025-11-09 12:37:01'),
(112, 'ssssssssssssssssss', 15, '2025-11-09 12:37:47', '2025-11-09 12:37:47'),
(113, '7777777777777777777', 15, '2025-11-09 13:04:47', '2025-11-09 13:04:47'),
(114, '--------------', 15, '2025-11-09 13:05:17', '2025-11-09 13:05:17'),
(115, '==============', 15, '2025-11-09 13:05:31', '2025-11-09 13:05:31'),
(116, '101010101011', 15, '2025-11-09 13:06:19', '2025-11-09 13:06:19'),
(118, 'ssssssssssss', 15, '2025-11-09 13:13:56', '2025-11-09 13:13:56'),
(119, 'ssss', 15, '2025-11-10 04:57:22', '2025-11-10 04:57:22'),
(120, 'ssss', 15, '2025-11-10 04:57:26', '2025-11-10 04:57:26'),
(121, '11111', 15, '2025-11-10 04:57:43', '2025-11-10 04:57:43'),
(122, '111111111', 15, '2025-11-10 08:46:49', '2025-11-10 08:46:49'),
(123, 'qqqqqqqqq', 15, '2025-11-10 08:47:33', '2025-11-10 08:47:33'),
(124, '111111', 15, '2025-11-10 08:48:28', '2025-11-10 08:48:28'),
(125, 'ssssssss', 15, '2025-11-10 08:54:53', '2025-11-10 08:54:53'),
(126, 'qqqqqqqqqqq', 15, '2025-11-10 09:06:56', '2025-11-10 09:06:56'),
(127, 'ssssssssss', 15, '2025-11-10 10:30:39', '2025-11-10 10:30:39'),
(128, 'dddddd9\n', 15, '2025-11-10 11:11:52', '2025-11-10 11:11:52'),
(129, 'dddddd9\n', 15, '2025-11-10 11:12:05', '2025-11-10 11:12:05'),
(131, 'اتصال به نت', 12, '2025-11-11 12:58:14', '2025-11-11 12:58:14'),
(132, 'باز کردن Store.در صورت نیاز Region سیستم تغییر کند به US', 12, '2025-11-11 12:58:59', '2025-11-11 12:58:59'),
(133, 'باز کردن Photos , کلیک روی گزینه Repair(Restore)', 12, '2025-11-11 13:00:21', '2025-11-11 13:00:21'),
(134, '192.168.0.2', 1, '2025-11-11 13:11:51', '2025-11-11 13:11:51'),
(135, 'در ez connect نام کاربری خود و رمز عبور(رمز ویندوز) را وارد کنید.', 1, '2025-11-11 13:13:01', '2025-11-11 13:13:01'),
(136, 'مرورگر را باز کنید در صورتی که صفحه لاگین باز نشد در آدرس بار مرورگر 192.168.0.2 را بزنید و اطلاعات راوارد کنید', 1, '2025-11-11 13:14:11', '2025-11-11 13:14:11'),
(138, 'Client : منوی استارت تایپ winver و مشاهده نسخه ویندوز', 40, '2025-11-12 08:18:51', '2025-11-12 08:18:51'),
(139, 'Client : دانلود و نصب نسخه RSAT مرتبط با ویندوز از لینک زیر\nhttps://www.microsoft.com/en-us/download/details.aspx?id=45520', 40, '2025-11-12 08:22:42', '2025-11-12 08:22:42'),
(140, 'Server : در windows Server Server Manager -> Manage -> Add Roles and Features انتخاب features هایی که میخواهیم در کلاینت در دسترس باشند', 40, '2025-11-12 08:29:31', '2025-11-12 08:29:31'),
(141, 'ادرس https://store.rg-adguard.net', 68, '2025-11-13 05:48:01', '2025-11-13 05:48:01'),
(142, 'آدرس برنامه مورد نظر را کپی کرده و گزینه Retail را انتخاب می کنیم', 68, '2025-11-13 05:49:04', '2025-11-13 05:49:04'),
(143, 'از میان فایل های لیست شده بسته به نسخه ویندوز x-86 ، x-64 را دانلود کرده. در صورت وجود پیشنیاز ممکن است نیاز به دانلود فایل های دیگر باشد.', 68, '2025-11-13 05:50:41', '2025-11-13 05:50:41'),
(144, 'فایل های با پسوند map که حجم کمی هم دارند مهم نیستند', 68, '2025-11-13 05:51:05', '2025-11-13 05:51:05'),
(145, 'لاگین با کاربر ادمین لوکال .power-shell با run as admin', 97, '2025-11-16 11:52:20', '2025-11-16 11:52:20'),
(146, 'test-ComputerSecureChannel', 97, '2025-11-16 11:55:14', '2025-11-16 11:55:14'),
(147, ' اگر پیام false داد با نام کاربری و رمز ادمین کد زیر را میزنیم', 97, '2025-11-16 11:55:19', '2025-11-16 11:55:19'),
(157, 'test-ComputerSecureChannel -Repair -Credential delijancement.local\\abdolhosseini', 97, '2025-11-18 04:48:43', '2025-11-18 04:48:43'),
(158, 'در صورت داشتن کاربری ادمین اکتیودایرکتوری میتوان کد زیر را برای رفع مشکل پسورد استفاده کرد ', 97, '2025-11-18 04:50:17', '2025-11-18 04:50:17'),
(159, 'Reset-ComputerMachinePassword -Server ADDS -Credential delijancement.local/superAdminName', 97, '2025-11-18 04:50:26', '2025-11-18 04:50:26'),
(160, 'Power Shell ISE گرافیکی Rus As Admin', 106, '2025-11-18 04:55:36', '2025-11-18 04:55:36'),
(161, 'file->new کپی کد زیر و دکمه run', 106, '2025-11-18 04:56:12', '2025-11-18 04:56:12'),
(162, 'Get-AppxPackage -AllUsers | Foreach {\n    Try {\n        Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"\n    } Catch {}\n}', 106, '2025-11-18 04:58:29', '2025-11-18 04:58:29'),
(163, '\\\\192.168.0.19\\Program', 107, '2025-11-18 05:00:48', '2025-11-18 05:00:48'),
(164, 'RestoreWindowsPhotoViewerSetup.exe', 107, '2025-11-18 05:00:56', '2025-11-18 05:00:56'),
(165, 'نصب و باز کردن عکس ها با این برنامه', 107, '2025-11-18 05:01:16', '2025-11-18 05:01:16'),
(166, 'برای رفع مشکل photo میتوان از طریق microsoft Store اقدام کرد', 107, '2025-11-18 05:03:00', '2025-11-18 05:03:00'),
(167, 'به سیستم اینترنت داده و استور را باز کرده.در صورت عدم بارگذاری region را تغییر دهید.پس از باز شدن برنامه photo را جستجو کرده و گزینه restore(repair) را بزنید. از طریق settings -apps -photo نیز برنامه را reset و repair کنید', 107, '2025-11-18 05:06:19', '2025-11-18 05:06:19'),
(168, '\\\\192.168.0.19\\Program', 108, '2025-11-18 05:09:00', '2025-11-18 05:09:00'),
(169, 'KeyboardTestUtility.exe', 108, '2025-11-18 05:09:10', '2025-11-18 05:09:10'),
(172, 'فایل زیر را run as admin باز کرده و سپس نام pc مورد نظر را مینویسیم سپس توضیحات مورد نظر را در کادر جدید مینویسیم', 110, '2025-11-18 05:25:52', '2025-11-18 05:25:52'),
(173, 'D:\\files\\programs', 110, '2025-11-18 05:26:16', '2025-11-18 05:26:16'),
(174, 'CCDescription.exe', 110, '2025-11-18 05:26:23', '2025-11-18 05:26:23'),
(175, '168.168.0.221', 111, '2025-11-20 05:46:12', '2025-11-20 05:46:12'),
(176, 'تنظیم NTP سرور به عنوان سرور اپدیت ساعت ویندوز', 111, '2025-11-20 05:47:31', '2025-11-20 05:47:31'),
(177, '192.168.0.2', 112, '2025-11-20 06:20:26', '2025-11-20 06:20:26'),
(178, 'نام کاربری + پسورد ویندوز', 112, '2025-11-20 06:20:41', '2025-11-20 06:20:41'),
(179, '192.168.0.3', 113, '2025-11-20 06:22:21', '2025-11-20 06:22:21'),
(180, 'نام کاربری 110 رمز ******', 113, '2025-11-20 06:22:47', '2025-11-20 06:22:47'),
(181, 'برای اتصال به کلاینت مانیتورینگ از طریق Dame Ware به سیستم MONITORING وصل میشویم', 113, '2025-11-20 06:23:52', '2025-11-20 06:23:52'),
(182, 'در مرورگر فایرفاکس.ادرس IP بالا را وارد میکنیم . منوی devices حالت نمایش Tree View و غیرفعال کردن paused sensors', 113, '2025-11-20 06:28:29', '2025-11-20 06:28:29'),
(183, 'Lansweeper با توجه به نام کاربر یا نام کامپیوتر', 114, '2025-11-20 06:31:08', '2025-11-20 06:31:08'),
(184, 'پینگ نام کاربر در cmd.', 114, '2025-11-20 06:31:32', '2025-11-20 06:31:32'),
(185, 'پیدا کردن نام کامپیوتر از dame ware , گرفتن پینگ از cmd', 114, '2025-11-20 06:32:08', '2025-11-20 06:32:08'),
(186, '\\\\192.168.0.24', 115, '2025-11-20 07:00:05', '2025-11-20 07:00:05'),
(187, 'فقط پوشه File Server برای کاربر Map شود.', 115, '2025-11-20 07:00:51', '2025-11-20 07:00:51'),
(188, '192.168.0.37', 116, '2025-11-20 07:06:17', '2025-11-20 07:06:17'),
(189, '192.168.0.7', 117, '2025-11-20 07:10:04', '2025-11-20 07:10:04'),
(190, 'در صفحه اصلی منوی view گزینه Default Host Properties', 117, '2025-11-20 07:10:52', '2025-11-20 07:10:52'),
(191, 'تب Authentication Option\nAuthentication Type = Windows NT Challenge/Response\nچک Use Current Windows Credential', 117, '2025-11-20 07:39:41', '2025-11-20 07:39:41'),
(192, 'تب Remote Option\nShow Remote Cursor برای نمایش موس سمت کلاینت', 117, '2025-11-20 07:42:20', '2025-11-20 07:42:20'),
(193, '\\\\192.168.0.19\\Program\\Genetec\\Security_Center_v_5_6_SR1_b781_55_Full', 119, '2025-11-20 07:44:37', '2025-11-20 07:44:37'),
(194, 'حذف تیک Server , \nفقط نسخه Omni .... 4.7 نصب شود.', 119, '2025-11-20 07:47:21', '2025-11-20 07:47:21'),
(195, 'یوزر 227', 119, '2025-11-20 07:47:25', '2025-11-20 07:47:25'),
(196, '192.168.0.21', 119, '2025-11-20 07:48:16', '2025-11-20 07:48:16'),
(197, '\\\\192.168.0.19\\Program\\Genetec', 120, '2025-11-20 07:51:48', '2025-11-20 07:51:48'),
(198, 'iVMS-4200V3.7.1.5_E.exe', 120, '2025-11-20 07:51:56', '2025-11-20 07:51:56'),
(199, 'یک نام کاربری و رمز برای برنامه انتخاب میشود.\nبرای دوربین ها هرکدام نام/رمز ممکن است متفاوت باشد.', 120, '2025-11-20 07:52:26', '2025-11-20 07:52:26'),
(200, '192.168.0.213 , 192.168.0.219 , 192.168.0.237 , 192.168.0.238\nadmin/@*****', 120, '2025-11-20 07:53:30', '2025-11-20 07:53:30'),
(201, 'DeviceManagement -> Device -> Add', 120, '2025-11-20 07:54:16', '2025-11-20 07:54:16'),
(202, 'ادرس های فوق را اضافه میکنیم و نام/رمز را وارد میکنیم پورت 8000 و add.\nسپس در main view مشاهده شود', 120, '2025-11-20 07:59:07', '2025-11-20 07:59:07'),
(203, 'http://192.168.0.3:81/login.aspx', 121, '2025-11-20 08:18:11', '2025-11-20 08:18:11'),
(204, 'username/pass  ویندوز', 121, '2025-11-20 08:18:26', '2025-11-20 08:18:26'),
(205, 'start->devices & Printers ->add device-> add manually', 123, '2025-11-20 11:16:25', '2025-11-20 11:16:25'),
(206, 'add a local printer -> Standard TCP/IP\nport setting : 192.168.0.18\nprotocol: LPR\n', 123, '2025-11-20 11:17:52', '2025-11-20 11:17:52'),
(207, 'LPR Settings:\nQueue name:', 123, '2025-11-20 11:18:46', '2025-11-20 11:18:46'),
(208, 'f0031739', 123, '2025-11-20 11:18:51', '2025-11-20 11:18:51'),
(210, 'دو روش  هر دو از طریق Win + Run', 124, '2025-11-20 11:29:09', '2025-11-20 11:29:09'),
(211, 'Printui  /s', 124, '2025-11-20 11:29:19', '2025-11-20 11:29:19'),
(212, 'نصب نرم افزار smart view روی سیستم کلاینت از  طریق لینک زیر. نسخه 4.3 و هنگام نصب پیام نصب درایور ویدیو no انتخاب شود.', 125, '2025-11-22 05:29:09', '2025-11-22 05:29:09'),
(213, '\\\\192.168.0.19\\Program\\SmartView 4.3', 125, '2025-11-22 05:29:21', '2025-11-22 05:29:21'),
(214, 'net time/domain', 111, '2025-11-22 06:17:22', '2025-11-22 06:17:22'),
(216, 'لیست درایورها . از طریق CMD run as Admin', 128, '2025-11-22 08:28:05', '2025-11-22 08:28:05'),
(217, 'pnputil /enum-drivers', 128, '2025-11-22 08:28:08', '2025-11-22 08:28:08'),
(218, 'dism /online /get-drivers', 128, '2025-11-22 08:29:18', '2025-11-22 08:29:18'),
(219, 'لیست درایور های پرینتر  Win + Run', 128, '2025-11-22 08:31:24', '2025-11-22 08:31:24'),
(220, 'printmanagement.msc', 128, '2025-11-22 08:31:37', '2025-11-22 08:31:37'),
(221, 'برای حذف هر دو روش pnp util , dism  دسترسی ادمین', 128, '2025-11-22 08:34:35', '2025-11-22 08:34:35'),
(222, 'pnputil /delete-driver name.inf /unistall /force', 128, '2025-11-22 08:35:11', '2025-11-22 08:35:11'),
(223, 'dism /online /remove-driver /driver:name.inf', 128, '2025-11-22 08:35:54', '2025-11-22 08:35:54'),
(225, 'printanagement.msc', 124, '2025-11-22 08:38:44', '2025-11-22 08:38:44'),
(226, 'تغییر نام سیستم و ریستارت', 136, '2025-11-26 11:20:53', '2025-11-26 11:20:53'),
(227, 'جوین به دامین و ریستارت\ndelijancement.local', 136, '2025-11-26 11:21:08', '2025-11-26 11:21:08'),
(228, 'اکتیوکردن ویندوز و اضافه کردن آیکون This PC به دسکتاپ\n R_click-personalize-theme->Desktop Icon Settings', 136, '2025-11-26 11:23:13', '2025-11-26 11:23:13'),
(229, 'نصب درایورها با استفاده از SamDrivers(47.5GB) فایل SDI64-drv.exe\nrun as Admin', 136, '2025-11-26 11:25:53', '2025-11-26 11:25:53'),
(230, '\\\\192.168.0.19\\Driver', 136, '2025-11-26 11:26:27', '2025-11-26 11:26:27'),
(231, 'openPort اجرا به عنوان Admin \n\\\\192.168.0.19\\Program', 136, '2025-11-26 11:27:31', '2025-11-26 11:27:31'),
(232, 'نصب کسپراسکای و لایسنس', 136, '2025-11-26 11:27:52', '2025-11-26 11:27:52'),
(233, 'نصب کیبورد فارسی . فونت ری استارت و اضافه کردن کیبورد فارسی\n', 136, '2025-11-26 11:29:22', '2025-11-26 11:29:22'),
(234, '\\\\192.168.0.19\\Program\\Farsi\\PersianKeyboard-Habibirad (Windows 10)', 136, '2025-11-26 11:29:25', '2025-11-26 11:29:25'),
(235, '\\\\192.168.0.19\\Program\\Farsi\\Font Farsi\\Fonts', 136, '2025-11-26 11:29:38', '2025-11-26 11:29:38'),
(236, 'ثبت Description کامپیوتر', 136, '2025-11-26 11:30:08', '2025-11-26 11:30:08'),
(237, 'کانفیگ تایم زون،پاورپلن،تسکبار،استارتاپ اپس', 136, '2025-11-26 11:30:32', '2025-11-26 11:30:32'),
(238, 'office2021 (active), winRar , adobe reader , google Chrome (default), firefox', 136, '2025-11-26 11:31:01', '2025-11-26 11:31:01'),
(240, '\\\\192.168.0.19\\Program\\PDF\\Adobe.Acrobat.Reader.DC.2020.012.20041', 136, '2025-11-26 11:31:59', '2025-11-26 11:31:59'),
(242, 'برید و راهکاران. کپی میانبرها به دسکتاپ و فایل های ایکن به system32', 136, '2025-11-26 11:33:11', '2025-11-26 11:33:11'),
(244, '\\\\192.168.0.19\\DelijanCement\\', 136, '2025-11-26 11:33:51', '2025-11-26 11:33:51'),
(245, 'تست DameWare ریموت', 136, '2025-11-26 11:41:26', '2025-11-26 11:41:26'),
(246, 'لاگین با کاربر ادمین لوکال .power-shell با run as admin', 137, '2025-11-26 12:04:44', '2025-11-26 12:04:44'),
(247, 'test-ComputerSecureChannel', 137, '2025-11-26 12:05:58', '2025-11-26 12:05:58'),
(248, ' اگر پیام false داد با نام کاربری و رمز ادمین کد زیر را میزنیم', 137, '2025-11-26 12:06:04', '2025-11-26 12:06:04'),
(249, 'Test-ComputerSecureChannel -Repair -Credential delijancement.local\\abdolhosseini -Verbose', 137, '2025-11-26 12:06:08', '2025-11-26 12:06:08'),
(250, 'حتما باید پیام true  بدهد در غیر اینصورت دوباره کد بالا را وارد کرده تا پیام true ظاهر شود', 137, '2025-11-26 12:06:13', '2025-11-26 12:06:13'),
(251, 'در صورت داشتن کاربری ادمین اکتیودایرکتوری میتوان کد زیر را برای رفع مشکل پسورد استفاده کرد', 137, '2025-11-26 12:06:20', '2025-11-26 12:06:20'),
(252, '\\\\192.168.0.19\\', 138, '2025-11-27 04:31:53', '2025-11-27 04:31:53'),
(258, '\\\\192.168.0.19\\Program', 139, '2025-11-27 04:47:51', '2025-11-27 04:47:51'),
(259, 'open.bat', 139, '2025-11-27 04:47:59', '2025-11-27 04:47:59'),
(260, 'Run As Admin', 139, '2025-11-27 04:48:10', '2025-11-27 04:48:10'),
(261, 'نصب نرم افزار 4.3 smart view روی سیستم کلاینت،پیام نصب درایور ویدیو no انتخاب شود.', 143, '2025-11-27 05:23:49', '2025-11-27 05:23:49'),
(262, '\\\\192.168.0.19\\Program\\SmartView 4.3', 143, '2025-11-27 05:23:57', '2025-11-27 05:23:57'),
(263, '\\\\192.168.0.19\\Program\\Genetec', 144, '2025-11-27 05:28:09', '2025-11-27 05:28:09'),
(264, 'iVMS-4200V3.7.1.5_E.exe', 144, '2025-11-27 05:28:13', '2025-11-27 05:28:13'),
(265, 'یک نام کاربری و رمز برای برنامه انتخاب میشود. برای دوربین ها هرکدام نام/رمز ممکن است متفاوت باشد.', 144, '2025-11-27 05:28:19', '2025-11-27 05:28:19'),
(266, '192.168.0.213 , 192.168.0.219 , 192.168.0.237 , 192.168.0.238 admin/@*****', 144, '2025-11-27 05:28:25', '2025-11-27 05:28:25'),
(267, 'DeviceManagement -> Device -> Add', 144, '2025-11-27 05:28:30', '2025-11-27 05:28:30'),
(268, 'ادرس های فوق را اضافه میکنیم و نام/رمز را وارد میکنیم پورت 8000 و add. سپس در main view مشاهده شود', 144, '2025-11-27 05:28:35', '2025-11-27 05:28:35'),
(269, '\\\\192.168.0.19\\Program\\Genetec\\Security_Center_v_5_6_SR1_b781_55_Full', 146, '2025-11-27 05:30:12', '2025-11-27 05:30:12'),
(270, 'حذف تیک Server , فقط نسخه Omni .... 4.7 نصب شود.', 146, '2025-11-27 05:30:18', '2025-11-27 05:30:18'),
(271, 'یوزر 227', 146, '2025-11-27 05:30:23', '2025-11-27 05:30:23'),
(272, '192.168.0.21', 146, '2025-11-27 05:30:30', '2025-11-27 05:30:30'),
(273, 'تنظیم NTP سرور به عنوان سرور اپدیت ساعت ویندوز', 147, '2025-11-27 05:31:28', '2025-11-27 05:31:28'),
(274, 'راست کلیک روی ساعت.\nAdjust Date & Time . انتخاب گزینه Sync , دکمه change.\nدر صورت غیرفعال بودن گزینه ها لاگین با یوزر ادمین.\nثبت آدرس زیر', 147, '2025-11-27 05:31:32', '2025-11-27 05:31:32'),
(275, '168.168.0.221', 147, '2025-11-27 05:31:46', '2025-11-27 05:31:46'),
(276, 'نصب و باز کردن عکس ها با برنامه زیر', 148, '2025-11-27 05:32:50', '2025-11-27 05:32:50'),
(277, '\\\\192.168.0.19\\Program\\RestoreWindowsPhotoViewerSetup.exe', 148, '2025-11-27 05:32:56', '2025-11-27 05:32:56'),
(278, 'برای رفع مشکل photo میتوان از طریق microsoft Store اقدام کرد', 148, '2025-11-27 05:35:24', '2025-11-27 05:35:24'),
(279, 'به سیستم اینترنت داده و استور را باز کرده.در صورت عدم بارگذاری region را تغییر دهید.پس از باز شدن برنامه photo را جستجو کرده و گزینه restore(repair) را بزنید. از طریق settings -apps -photo میز برنامه را reset و repair کنید', 148, '2025-11-27 05:35:31', '2025-11-27 05:35:31'),
(280, 'Power Shell ISE گرافیکی Rus As Admin', 149, '2025-11-27 05:36:38', '2025-11-27 05:36:38'),
(281, 'file->new کپی کد زیر و دکمه run', 149, '2025-11-27 05:36:42', '2025-11-27 05:36:42'),
(282, 'Get-AppxPackage -AllUsers | Foreach { Try { Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\" } Catch {} }', 149, '2025-11-27 05:36:48', '2025-11-27 05:36:48'),
(283, 'ادرس https://store.rg-adguard.net', 150, '2025-11-27 05:37:47', '2025-11-27 05:37:47'),
(284, 'آدرس برنامه مورد نظر را کپی کرده و گزینه Retail را انتخاب می کنیم', 150, '2025-11-27 05:37:49', '2025-11-27 05:37:49'),
(285, 'از میان فایل های لیست شده بسته به نسخه ویندوز x-86 ، x-64 را دانلود کرده. در صورت وجود پیشنیاز ممکن است نیاز به دانلود فایل های دیگر باشد.', 150, '2025-11-27 05:37:53', '2025-11-27 05:37:53'),
(286, 'فایل های با پسوند map که حجم کمی هم دارند مهم نیستند', 150, '2025-11-27 05:37:59', '2025-11-27 05:37:59'),
(287, 'در صورت وجود پیشنیاز فایل های موجود را هم دانلود نمایید', 150, '2025-11-27 05:39:27', '2025-11-27 05:39:27'),
(288, 'ابتدا باید فایل csr جدیدی از سرور iis تولید شود(توسط ادمین سرور سایت)', 151, '2025-11-27 05:42:56', '2025-11-27 05:42:56'),
(289, 'ارسال فایل بصورت تیکت برای رادکام.\nدر صورت عدم امکان تهیه فایل مورد نظر میتوان در تیکت از خود رادکام درخواست تولید این فایل را داشت.\nحتما در متن تیکت عنوان شود فایل های\nkey.key , cert.crt, pfx.pfx, ca.ca مورد درخواست هستند', 151, '2025-11-27 05:43:31', '2025-11-27 05:43:31'),
(290, 'دریافت ایمیل/جیمیل وریفای توسط مهندس کتیرایی و انجام مراحل وریفای', 151, '2025-11-27 05:44:26', '2025-11-27 05:44:26'),
(292, 'پس از وریفای،فایل های زیر باید از طرف رادکام ارسال شوند.\nkey.key cert.crt pfx.pfx ca.ca ', 151, '2025-11-27 05:48:41', '2025-11-27 05:48:41'),
(293, 'در بدترین صورت وجود دو فایل با پسوند crt و key لازم است. میتوان با دستورات openssl یا از طریق سایت sslshoper عملیات تبدیل را انجام داد.\nبرای ثبت گواهی در ویندوز سرور از فایل pfx استفاده میشود. \nمحتویات فایل ها', 151, '2025-11-27 05:51:51', '2025-11-27 05:51:51'),
(294, 'rsa certificate ->csr\ncertificate ->crt\nprivatekey -> key', 151, '2025-11-27 06:03:39', '2025-11-27 06:03:39'),
(298, 'ProgramKeyboardTestUtility.exe', 138, '2025-12-03 05:52:47', '2025-12-03 05:52:47'),
(301, '\\\\192.168.0.19\\Driver\\Scanner\\Plustek SmartOffice PN2040\\Plustek SmartOffice PN2040 V6.1.0.1 Build 1000', 152, '2025-12-08 10:29:00', '2025-12-08 10:29:00'),
(312, 'پس از نصب باید کالیبره شود تا خطایی نگیریم.داخل پوشه نصب کالیبره میشود', 152, '2025-12-08 10:35:18', '2025-12-08 10:35:18'),
(313, 'از طریق منوی استارت  services را Run as Admin کرده.', 153, '2025-12-13 04:35:15', '2025-12-13 04:35:15'),
(314, 'سرویس newsgWheight..... را ری استارت Restart میکنیم.\nبا tray کاری نداریم', 153, '2025-12-13 04:36:43', '2025-12-13 04:36:43'),
(315, 'ابتدا سیستم میزبان پرینتر را ریستارت میکنیم.', 154, '2025-12-16 08:43:00', '2025-12-16 08:43:00'),
(316, 'پرینتر پایانه 2035 به سیستم payaneh3 متصل است.', 154, '2025-12-16 08:44:49', '2025-12-16 08:44:49'),
(317, 'پرینتر پایین انبار m607 plc به سیستم anbar5 متصل است.', 154, '2025-12-16 08:45:05', '2025-12-16 08:45:05'),
(318, 'به محل نصب نرم افزار prtg رفته داخل پوشه webroot\\css.\n  تغییرmain.css برای نسخه اصلی و main.dark.css برای نسخه تاریک.', 155, '2025-12-17 04:46:40', '2025-12-17 04:46:40'),
(319, 'برای اعمال تغییرات پس از هر تغییر باید از منوی administrative tools  کش وب را حذف کنیم.', 155, '2025-12-17 04:47:25', '2025-12-17 04:47:25'),
(320, 'بر روی فایل مورد نظر راست کلیک کرده properties و سپس تب security را زده بر روی دکمه edit زده و به کاربر سیستم دسترسی کامل read/write میدهیم', 155, '2025-12-17 04:49:17', '2025-12-17 04:49:17'),
(321, 'برای حذف هر المنت باید کلاس آن را در فایل جستجو کنیم و خصوصیت display:none!important;«‎‎» به آن بدهیم', 155, '2025-12-17 04:56:43', '2025-12-17 04:56:43'),
(322, 'برای حذف گراف ها : \n.fix-panel{display:none!important;}\n‎پیداکردن .col-panel و اصلاح خصوصیت width:calc(100% - xxx) به width:100%!important;', 155, '2025-12-17 05:04:03', '2025-12-17 05:04:03'),
(323, 'منوها :\nکلاس header \ndisplay:none!important;', 155, '2025-12-17 05:05:51', '2025-12-17 05:05:51'),
(324, 'مسیر جاری: کلاس header_breadcrumbs', 155, '2025-12-17 05:06:44', '2025-12-17 05:06:44'),
(325, 'نوار overview - 24 hours- 30days- .... :\n کلاس nav-tabs', 155, '2025-12-17 05:10:33', '2025-12-17 05:10:33'),
(326, 'برای حذف نوار groupRoot تگ dummy را جستجو کرد', 155, '2025-12-17 05:11:50', '2025-12-17 05:11:50'),
(327, 'برای فونت خاصیت font-size:9px; را جستجو کرده و آن را به 15 تغییر میدهیم\nیا .cell.device را جستجو میکنیم تا font-size:9px; را پیداکنیم', 155, '2025-12-17 05:17:57', '2025-12-17 05:17:57'),
(328, 'Program Files\\VMware\\VMware Tools\\VMwareResolutionSet.exe\nرا تغییر نام دهید', 156, '2025-12-17 07:25:40', '2025-12-17 07:25:40'),
(329, 'یا تغییر تنظیمات کارت گرافیک ماشین مورد نظر از custom به auto-detect\n(ماشین باید خاموش باشد)', 156, '2025-12-17 07:29:30', '2025-12-17 07:29:30'),
(330, 'http://192.168.0.3/group.htm?id=0&tabid=1', 157, '2025-12-17 08:54:14', '2025-12-17 08:54:14'),
(331, 'dark:110\nmain :user', 157, '2025-12-17 08:55:08', '2025-12-17 08:55:08'),
(332, 'http://192.168.0.3:81/login.aspx', 158, '2025-12-17 08:57:11', '2025-12-17 08:57:11'),
(333, 'abdolhosseini\nwindows login', 158, '2025-12-17 08:57:35', '2025-12-17 08:57:35'),
(334, 'سرور جدید\nhttp://192.168.0.16', 157, '2025-12-17 09:00:11', '2025-12-17 09:00:11'),
(335, '35DPH-SVSXJ-HGBJN-C7N5R-2SS4W', 159, '2025-12-18 06:30:07', '2025-12-18 06:30:07'),
(336, 'ILO 4 : \n35DPH-SVSXJ-HGBJN-C7N5R-2SS4W', 159, '2025-12-18 06:31:29', '2025-12-18 06:31:29'),
(337, 'ILO 5:\n35DPH-SVSXJ-HGBJN-C7N5R-2SS4W', 159, '2025-12-18 06:31:59', '2025-12-18 06:31:59'),
(338, 'ILO 3 :\n35S9R-4XCM9-95RVJ-PWDK7-M7RSR', 159, '2025-12-18 06:32:21', '2025-12-18 06:32:21'),
(339, 'Reset-ComputerMachinePassword -Server ADDS -Credential delijancement.local/abdolhosseini -Verbose', 137, '2026-01-07 05:52:36', '2026-01-07 05:52:36'),
(340, 'Start->Printers&Scanners->add device->Add manually\n', 160, '2026-01-08 05:04:05', '2026-01-08 05:04:05'),
(341, 'add a local printer\nstandard tcp/ip\nport setting: 192.168.0.18\nprotocol : LPR\nLPR setting-> Queue name:f0031739', 160, '2026-01-08 05:04:12', '2026-01-08 05:04:12'),
(342, 'https://cdn.technet24.ir/Downloads/Cisco/IOS/Cisco_usbconsole_driver_3_1.zip', 161, '2026-01-08 05:27:41', '2026-01-08 05:27:41'),
(343, 'https://software.cisco.com/download/home', 162, '2026-01-08 05:29:06', '2026-01-08 05:29:06'),
(344, 'انتخاب مدل دستگاه .\nبرای دانلود مستقیم به حساب سیسکو نیاز است.موارد ستاره دار گزینه ی توصیه شده هستند.', 162, '2026-01-08 05:30:07', '2026-01-08 05:30:07'),
(345, 'مراحل طبق فایل پیوست شده', 164, '2026-01-18 05:40:05', '2026-01-18 05:40:05'),
(346, 'https://192.168.0.21/webclient/#/login', 165, '2026-01-19 11:20:38', '2026-01-19 11:20:38'),
(347, '192.168.47.47', 166, '2026-01-24 11:57:25', '2026-01-24 11:57:25'),
(348, 'کپی فونت ها به پوشه فونت ویندوز', 167, '2026-01-25 11:22:52', '2026-01-25 11:22:52'),
(349, 'نصب برنامه با توجه به اولویت پوشه ها.کپی DLL ها به پوشه sysWOW64 , اجرای دستورات رجیستری در cmd , کپی شورتکات مربوطه در پوشه 5 و حذف شورتکات همداد نصب شده از دسکتاپ(شبیه خانه سبز و آبی),', 167, '2026-01-25 11:27:11', '2026-01-25 11:27:11'),
(350, 'تنظیمات region and language :\nRegion : Iran\nRegional Format : English\nطبق تصویر پیوست', 167, '2026-01-25 11:29:17', '2026-01-25 11:29:17'),
(351, 'از این دستور نیز میتوان استفاده کرد\nnet time/domain', 147, '2026-01-26 04:30:11', '2026-01-26 04:30:11'),
(352, 'باید در firewall تمام پورت های ورودی و خروجی باز شوند.', 168, '2026-01-26 04:33:51', '2026-01-26 04:33:51'),
(353, 'tcp -> all ports -> allow', 168, '2026-01-26 04:35:24', '2026-01-26 04:35:24'),
(354, 'admin\npasse admin', 169, '2026-01-26 10:44:02', '2026-01-26 10:44:02'),
(355, 'حجم هارد دیسک بالای 50گیگ\nانتخاب install.....\ncreate/modify partition\nno,continue to cfdisk\nnew->Primary->Bootable->write->yes->quit\nok\nانتخاب درایو ساخته شده -> ok\nformat EXT4 -> ok ->yes\nota NO\ngrub2 bootloader YES\nحذف دیسک و ریبوت.', 170, '2026-02-03 07:59:16', '2026-02-03 07:59:16'),
(356, 'درصورت مشاهده صفحه سیاه پس از انتخاب از منوی بوت. ریست کرده و گزینه ی no hw acceleration را انتخاب کنید', 170, '2026-02-03 08:03:33', '2026-02-03 08:03:33'),
(357, 'در صورت عدم وجود،گزینه ی pcmode را انتخاب کرده کلید e را زده روی خط اول مجدد کلید e و با جهت نما کلمه pcmode=1 را پیداکرده و پس از آن nomodeset را اضافه کرده کلید F10 یا CTRL+X را میزنیم', 170, '2026-02-03 08:06:03', '2026-02-03 08:06:03'),
(358, 'مرحله ۱: ماشین eve-NG', 171, '2026-02-05 04:54:24', '2026-02-05 04:54:24'),
(359, 'تنظیمات کارت شبکه: 2 کارت شبکه. حتما اولی NAT/Bridge برای مدیریت/اینترنت___دومی Custom: VMnet1 (Host-only) با یک آی پی مشخص در تنظیمات شبکه VMWare.(DHCP برای VMnet1 فعال باشد ) \nمثلا 192.168.10.0', 171, '2026-02-05 04:57:19', '2026-02-05 04:57:19'),
(360, 'مرحله ۲: فعال کردن eth0,eth1 در EVE و ساخت bridge جدید\nبا SSH به سرور EVE:(باssh میتوان صفحه را اسکرول کرد)', 171, '2026-02-05 05:06:22', '2026-02-05 05:06:22'),
(361, 'ifconfig -a', 171, '2026-02-05 05:06:42', '2026-02-05 05:06:42'),
(362, 'باید eth0,eth1 باشند(ممکنه down باشن).باید یک bridge ساخت و اونا رو به pmnet های متناظر وصل کرد.برای بررسی از دستور زیر استفاده میکنیم.', 171, '2026-02-05 05:08:23', '2026-02-05 05:08:23'),
(363, 'ifconfig -s لیست اینترفیس ها\nbrctl show لیست اینترفیس ها و بریج ها', 171, '2026-02-05 05:08:35', '2026-02-05 05:08:35'),
(364, 'pmnet0 به eth0 و pmnet1 به eth1 باید وصل باشند.', 171, '2026-02-05 05:09:11', '2026-02-05 05:09:11'),
(365, 'در صورت نبود بریج\nbrctl addbr pnet0\nbrctl addif pnet0 eth0\nbrctl addbr pnet1\nbrctl addif pnet1 eth1', 171, '2026-02-05 05:12:06', '2026-02-05 05:12:06'),
(366, 'ifconfig eth0 up\nifconfig pnet0 up\nifconfig eth1 up\nifconfig pnet1 up', 171, '2026-02-05 05:12:30', '2026-02-05 05:12:30'),
(367, 'بررسی :\n brctl show\nخروجی :\npnet0 → eth0\npnet1 → eth1', 171, '2026-02-05 05:13:17', '2026-02-05 05:13:17'),
(368, 'مرحله ۴: تنظیم ماشین XP و VPC\nداخل VMware برای XP مطمئن شو Adapterش روی VMnet1 (Host-only) هست.\nدر XP ثبت: IP: 192.168.56.1 Mask: 255.255.255.0\nدر VPC داخل EVE ثبت: ip 192.168.56.2 255.255.255.0', 171, '2026-02-05 05:14:21', '2026-02-05 05:14:21'),
(370, 'sudo nano /etc/netplan/*.yaml', 172, '2026-02-21 10:49:58', '2026-02-21 10:49:58'),
(371, 'استفاده از پیوست', 172, '2026-02-21 10:50:54', '2026-02-21 10:50:54'),
(372, 'بر اساس فایل پیوست.نیاز به شکن برای دانلود فایل ها.', 173, '2026-02-21 10:58:20', '2026-02-21 10:58:20'),
(373, 'برای خطایابی یا اصلاح موارد از فایلهای troubx و 123 استفاده شود\nدر نهایت باید در فایل jvb.conf مقادیر health را وارد کرد.', 173, '2026-02-21 11:02:24', '2026-02-21 11:02:24'),
(374, 'ssl self-signed با openssl بسازیم و باید در پوشه های مربوطه کپی کنیم.', 173, '2026-02-21 11:07:27', '2026-02-21 11:07:27'),
(375, 'برای خطایابی:\nsudo tail -n 100 /var/log/jitsi/jvb.log', 173, '2026-02-21 11:09:21', '2026-02-21 11:09:21'),
(376, 'nltest /sc_reset:delijancement.local\nnltest /sc_verify:delijancement.local', 137, '2026-02-28 05:57:38', '2026-02-28 05:57:38'),
(377, '55', 174, '2026-03-08 04:43:30', '2026-03-08 04:43:30'),
(378, 'sudo su -\npasswd root\nرمز جدید کاربر روت را وارد و تایید کنید', 175, '2026-03-12 09:05:44', '2026-03-12 09:05:44'),
(379, 'برای فعال کدن دسترسی روت برای winscp , ssh :\nnano /etc/ssh/sshd_config\nافزودن یا فعال کردن\nPermitRootLogin yes', 175, '2026-03-12 10:17:56', '2026-03-12 10:17:56'),
(380, 'باز کردن cmd.رفتن به پوشه  VMware که حاوی فایل vmware-vdiskmanager.exe .', 176, '2026-03-12 10:19:40', '2026-03-12 10:19:40'),
(381, 'vmware-vdiskmanager.exe -r \"D:\\fedora.vhdx\" -t 1 \"D:\\fedora1.vmdk\"', 176, '2026-03-12 10:19:46', '2026-03-12 10:19:46'),
(382, ' طبق فایل الصاقی sudo nano /etc/netplan/*.yaml', 177, '2026-03-12 10:24:41', '2026-03-12 10:24:41'),
(384, 'attachment', 178, '2026-03-12 10:40:14', '2026-03-12 10:40:14'),
(385, 'اکسترکت فایل نصب ویندوز از روی cd یا iso\nimagex.exe /apply j:\\sources\\install.win 1 f:\\address\n', 179, '2026-03-12 11:02:26', '2026-03-12 11:02:26'),
(386, 'bcd boot ', 179, '2026-03-12 11:02:50', '2026-03-12 11:02:50'),
(387, 'dism /Online /get-featureinfo /featurename:tftp /enable\nnet stop servicename\nsc delete servicename\n', 180, '2026-03-12 11:07:46', '2026-03-12 11:07:46'),
(388, 'حل مشکلات دسترسی ها\n/opt/ll/xx/xx fixpermissions', 178, '2026-03-12 11:11:00', '2026-03-12 11:11:00'),
(389, 'check attachments', 181, '2026-03-12 11:13:21', '2026-03-12 11:13:21');

-- --------------------------------------------------------

--
-- Table structure for table `miladi`
--

CREATE TABLE `miladi` (
  `id` int(11) NOT NULL,
  `holiday` varchar(255) DEFAULT NULL,
  `month` varchar(255) DEFAULT NULL,
  `day` varchar(255) DEFAULT NULL,
  `event` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci ROW_FORMAT=DYNAMIC;

--
-- Dumping data for table `miladi`
--

INSERT INTO `miladi` (`id`, `holiday`, `month`, `day`, `event`) VALUES
(1, NULL, '1', '1', 'جشن آغاز سال نو میلادی [ January 1 ]\r\n'),
(2, NULL, '2', '11', 'حمله به سفارت روسیه و قتل گریبایدوف سفیر روسیه تزاری در ایران[ February 11 ]'),
(3, NULL, '2', '14', 'جشن ولنتاین[ February 14 ]'),
(4, NULL, '3', '8', 'روزجهانی زنان[ March 8 ]'),
(6, NULL, '3', '14', 'روز جهانی عدد پی π[ March 14 ]'),
(7, NULL, '3', '20', 'روز جهانی شادی[ March 20 ]'),
(8, NULL, '3', '21', 'روز جهانی نوروز[ March 21 ]'),
(9, NULL, '3', '23', 'روز جهانی هواشناسی[ March 23 ]'),
(10, NULL, '3', '27', 'روز جهانی تئاتر[ March 27 ]'),
(11, NULL, '4', '7', 'روز جهانی بهداشت[ April 7 ]\r\n'),
(12, NULL, '4', '22', 'جشن گیاه آوری؛ روز زمین[ April 22 ]'),
(13, NULL, '4', '27', 'روز جهانی طراحی و گرافیک[ April 27 ]'),
(14, NULL, '5', '1', 'روزجهانی کارگر[ May 1 ]'),
(15, NULL, '5', '5', 'روز جهانی ماما[ May 5 ]'),
(16, NULL, '5', '8', 'روز جهانی صلیب سرخ و هلال احمر[ May 8 ]'),
(17, NULL, '5', '12', 'روز جهانی پرستار[ May 12 ]'),
(18, NULL, '5', '18', 'روز جهانی موزه و میراث فرهنگی[ May 18 ]'),
(19, NULL, '5', '31', 'روز جهانی بدون دخانیات[ May 31 ]\r\n'),
(20, NULL, '6', '5', 'روز جهانی محیط زیست[ June 5 ]'),
(21, NULL, '6', '10', 'روز جهانی صنایع دستی[ June 10 ]'),
(22, NULL, '6', '12', 'روز جهانی مبارزه با کار کودکان[ June 12 ]'),
(23, NULL, '6', '14', 'روز جهانی اهدای خون[ June 14 ]'),
(24, NULL, '6', '6', 'روز جهانی پدر[ June 16 ]'),
(25, NULL, '6', '17', 'روز جهانی بیابان زدایی[ June 17 ]'),
(26, NULL, '6', '26', 'روز جهانی مبارزه با مواد مخدر[ June 26 ]\r\n'),
(27, NULL, '8', '1', 'آغاز هفته جهانی شیردهی[ August 1 ]'),
(28, NULL, '8', '13', 'روز جهانی چپ دست ها[ August 13 ]'),
(29, NULL, '8', '19', 'روز جهانی عکاسی[ August 19 ]'),
(31, NULL, '9', '10', 'روز جهانی پیشگیری از خودکشی[ September 10 ]'),
(32, NULL, '9', '11', 'حمله به برج‌های دوقلوی مرکز تجارت جهانی[ September 11 ]'),
(33, NULL, '9', '13', 'روز گرامیداشت برنامه نویسان[ September 13 ]'),
(34, NULL, '9', '21', 'روز جهانی صلح[ September 21 ]'),
(35, NULL, '9', '27', 'روز جهانی جهانگردی[ September 27 ]'),
(36, NULL, '9', '30', 'روز جهانی ترجمه و مترجم, روز جهانی ناشنوایان[ September 30 ]'),
(38, NULL, '10', '1', 'روز جهانی سالمندان[ October 1 ]'),
(39, NULL, '10', '4', 'آغاز هفته جهانی فضا[ October 4 ]'),
(40, NULL, '10', '5', 'روز جهانی معلم[ October 5 ]'),
(41, NULL, '10', '9', 'روز جهانی پست[ October 9 ]'),
(42, NULL, '10', '10', 'روز جهانی مبارزه با حکم اعدام[ October 10 ]'),
(43, NULL, '10', '11', 'روز جهانی دختر[ October 11 ]'),
(44, NULL, '10', '14', 'روز جهانی استاندارد[ October 14 ]'),
(45, NULL, '10', '15', 'روز جهانی عصای سفید[ October 15 ]'),
(46, NULL, '10', '16', 'روز جهانی غذا[ October 16 ]'),
(47, NULL, '10', '17', 'روز جهانی ریشه کنی فقر[ October 17 ]'),
(48, NULL, '11', '14', 'روز جهانی دیابت[ November 14 ]'),
(49, NULL, '11', '19', 'روز جهانی آقایان[ November 19 ]'),
(50, NULL, '11', '20', 'روز جهانی کودک[ November 20 ]'),
(51, NULL, '11', '25', 'روز جهانی مبارزه با خشونت علیه زنان[ November 25 ]'),
(52, NULL, '12', '1', 'روز جهانی ایدز[ December 1 ]'),
(53, NULL, '12', '3', 'روز جهانی معلولان[ December 3 ]'),
(54, NULL, '12', '10', 'روز جهانی حقوق بشر[ December 10 ]'),
(55, NULL, '12', '11', 'روز جهانی کوهستان[ December 11 ]'),
(56, NULL, '12', '25', 'جشن کریسمس[ December 25 ]');

-- --------------------------------------------------------

--
-- Table structure for table `priorities`
--

CREATE TABLE `priorities` (
  `id` int(11) NOT NULL,
  `name` varchar(100) NOT NULL,
  `label` varchar(255) DEFAULT NULL,
  `color` varchar(20) DEFAULT 'default',
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci ROW_FORMAT=DYNAMIC;

--
-- Dumping data for table `priorities`
--

INSERT INTO `priorities` (`id`, `name`, `label`, `color`, `created_at`, `updated_at`) VALUES
(0, 'free', 'بی اهیمت', 'default', '2025-11-06 08:10:29', '2025-11-06 08:13:04'),
(1, 'low', 'پایین', 'info', '2025-11-06 08:10:51', '2025-11-06 08:13:28'),
(2, 'medium', 'متوسط', 'primary', '2025-11-06 08:10:55', '2025-11-06 08:14:22'),
(3, 'high', 'بالا', 'warning', '2025-11-06 08:11:06', '2025-11-06 08:14:29'),
(4, 'critical', 'حیاتی', 'danger', '2025-11-06 08:12:10', '2025-11-06 08:14:33');

-- --------------------------------------------------------

--
-- Table structure for table `statuses`
--

CREATE TABLE `statuses` (
  `id` int(11) NOT NULL,
  `name` varchar(100) NOT NULL,
  `label` varchar(255) DEFAULT NULL,
  `color` varchar(20) DEFAULT 'default',
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci ROW_FORMAT=DYNAMIC;

--
-- Dumping data for table `statuses`
--

INSERT INTO `statuses` (`id`, `name`, `label`, `color`, `created_at`, `updated_at`) VALUES
(0, 'free', 'ثبت شده', 'info', '2025-11-06 08:05:46', '2025-11-06 08:28:21'),
(1, 'started', 'جاری', 'primary', '2025-11-05 10:06:32', '2025-11-06 08:31:45'),
(2, 'done', 'تکمیل', 'success', '2025-11-05 10:07:17', '2025-11-06 08:31:48'),
(3, 'canceled', 'لغو', 'secondary', '2025-11-05 10:07:25', '2025-11-06 08:31:50');

-- --------------------------------------------------------

--
-- Table structure for table `tasks`
--

CREATE TABLE `tasks` (
  `id` int(11) NOT NULL,
  `name` varchar(255) DEFAULT NULL,
  `description` text DEFAULT NULL,
  `date` date DEFAULT NULL,
  `deadline` date DEFAULT NULL,
  `statusid` int(11) DEFAULT NULL,
  `timingid` int(11) DEFAULT NULL,
  `priorityid` int(11) DEFAULT NULL,
  `categoryid` int(11) DEFAULT NULL,
  `ownerid` int(11) DEFAULT NULL,
  `parent_id` int(11) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci ROW_FORMAT=DYNAMIC;

--
-- Dumping data for table `tasks`
--

INSERT INTO `tasks` (`id`, `name`, `description`, `date`, `deadline`, `statusid`, `timingid`, `priorityid`, `categoryid`, `ownerid`, `parent_id`, `created_at`, `updated_at`) VALUES
(136, 'نصب ویندوز', 'install windows steps مراحل نصب ویندوز', '2025-11-26', NULL, 0, NULL, NULL, 2, 16, NULL, '2025-11-26 11:20:16', '2025-11-26 11:20:16'),
(137, 'trust relationship', 'خطای تراست ریلیشن شیپ هنگام لاگین به ویندوز یا به کاربر ادمین ( هنگام نصب نرم افزار و ..... در سیستم کلاینت)', '2025-11-26', NULL, 0, NULL, NULL, 1, 16, NULL, '2025-11-26 12:04:24', '2025-11-26 12:04:24'),
(138, 'تست کیبورد', 'تست سلامت keyboard با نرم افزار', '2025-11-27', NULL, 0, NULL, NULL, 4, 16, NULL, '2025-11-27 04:31:22', '2025-11-27 04:31:22'),
(139, 'open port', 'باز کردن پورت ها', '2025-11-27', NULL, 0, NULL, NULL, 6, 16, NULL, '2025-11-27 04:47:41', '2025-11-27 04:47:41'),
(143, 'smart View', 'نرم افزار smart view برای سنسور حرارتی ترمال thermal شرکت فلوک fluke', '2025-11-27', NULL, 0, NULL, NULL, 7, 24, NULL, '2025-11-27 05:23:40', '2025-11-27 08:41:42'),
(144, 'IVMS 4200', 'IVMS 4200 دوربین انالوگ', '2025-11-27', NULL, 0, NULL, NULL, 3, 16, NULL, '2025-11-27 05:27:53', '2025-11-27 05:27:53'),
(146, 'Genetec Security', 'نصب نرم افزار Genetec', '2025-11-27', NULL, 0, NULL, NULL, 3, 16, NULL, '2025-11-27 05:30:07', '2025-11-27 05:30:07'),
(147, 'سینک کردن ساعت ویندوز', 'ممکن است ساعت ویندوز با شبکه همگام نباشد.باید internet time با سرور NTP آپدیت شود.', '2025-11-27', NULL, 0, NULL, NULL, 2, 16, NULL, '2025-11-27 05:31:10', '2025-11-27 05:31:10'),
(148, 'باز نشدن photo/جایگزین', 'پیام خطا هنگام باز کردن عکس با photo.', '2025-11-27', NULL, 0, NULL, NULL, 2, 16, NULL, '2025-11-27 05:32:42', '2025-11-27 06:06:55'),
(149, 'رفع پیام خطای microsoft Store برای تمام برنامه ها', 'در صورتی که هنگام باز کردن استور یا نصب برنامه های مایکروسافت استور خطا میگیریم. به  عنوان آخرین راه حل\r\nphoto , paint', '2025-11-27', NULL, 0, NULL, NULL, 2, 16, NULL, '2025-11-27 05:36:32', '2025-11-27 05:36:32'),
(150, 'دانلود برنامه های پولی Microsoft Store', 'نصب نرم افزار های پولی مایکروسافت استور بصورت رایگان', '2025-11-27', NULL, 0, NULL, NULL, 2, 16, NULL, '2025-11-27 05:37:37', '2025-11-27 05:38:35'),
(151, 'تمدید گواهی ssl', 'تمدید گواهی ssl سایت.', '2025-11-27', NULL, 0, NULL, NULL, 5, 16, NULL, '2025-11-27 05:40:49', '2025-11-27 05:40:49'),
(152, 'اسکنر plusteck', 'نصب درایور scanner plasteck آقای شهبازی.پلاس تک پلاستک', '2025-12-08', NULL, 0, NULL, NULL, 4, 16, NULL, '2025-12-08 10:28:55', '2025-12-08 10:28:55'),
(153, 'وزن کشی باسکول', 'صفر نشان دادن وزن باسکول عدم نمایش وزن باسکول وزن نکشیدن baskool', '2025-12-13', NULL, 0, NULL, NULL, 7, 16, NULL, '2025-12-13 04:34:29', '2026-01-08 04:54:33'),
(154, 'عدم شناسایی یا اتصال به پرینتر اشتراکی یک کلاینت', 'عدم اتصال به پرینتر های اشتراک شده. ناتوانی در حذف درایور های نصب شده روی سیستمی غیر از میزبان.برای مثال پرینتر انبار پایین به از سیستم anbar5 اشتراک گذاشته شده و بقیه مثل anbar3 از آن استفاده میکنند.در صورت شناسایی نشدن پرینتر در سیستم anbar3 میتوان از روش های موجود استفاده کرد', '2025-12-16', NULL, 0, NULL, NULL, 8, 16, NULL, '2025-12-16 08:40:49', '2025-12-16 08:48:51'),
(155, 'سفارشی سازی prtg', 'تغییر فونت و حذف گراف ها و موارد ناخواسته مثل منو ها در سرور مانیتورینگ', '2025-12-17', NULL, 0, NULL, NULL, 6, 16, NULL, '2025-12-17 04:37:30', '2025-12-17 05:25:44'),
(156, 'تغییر Resolution در esxi', 'زمان باز کردن یک vm با بروزر داخلی esxi رزولیشن تغییر میکند که در صورت ارتباط با ریموت دسکتاپ ابعاد تغییر کرده ', '2025-12-17', NULL, 0, NULL, NULL, 6, 16, NULL, '2025-12-17 07:24:40', '2025-12-17 07:24:40'),
(157, 'ادرس سرور PRTG', 'جهت اتصال به سرور مانیتورینگ برای مشاهده', '2025-12-17', NULL, 0, NULL, NULL, 5, 16, NULL, '2025-12-17 08:53:43', '2025-12-17 08:59:37'),
(158, 'Lansweeper', 'آدرس سرور Lansweeper جهت اتصال', '2025-12-17', NULL, 0, NULL, NULL, 5, 16, NULL, '2025-12-17 08:56:58', '2025-12-17 08:56:58'),
(159, 'لایسنس ILO 6', '', '2025-12-18', NULL, 0, NULL, NULL, 5, 16, NULL, '2025-12-18 06:30:04', '2025-12-18 06:30:04'),
(160, 'اتصال پرینتر 2014', 'عدم شناسایی پرینتر HP 2014 در ویندوز 10 و 11 با وجود نصب درایور. ', '2026-01-08', NULL, 0, NULL, NULL, 8, 16, NULL, '2026-01-08 04:57:36', '2026-01-08 04:57:36'),
(161, 'cisco usb_console Driver', 'درایور کنسول سیسکو', '2026-01-08', NULL, 0, NULL, NULL, 5, 16, NULL, '2026-01-08 05:27:35', '2026-01-13 05:15:49'),
(162, 'آخرین نسخه پیشنهادی سیسکو', 'بروزرسانی سیسکو', '2026-01-08', NULL, 0, NULL, NULL, 5, 16, NULL, '2026-01-08 05:28:59', '2026-01-08 05:28:59'),
(163, 'آپدیت فریمور سیسکو', 'بروزرسانی firmware سیسکو cisco ios upgrade update', '2026-01-08', NULL, 0, NULL, NULL, 5, 16, NULL, '2026-01-08 11:41:57', '2026-01-08 11:41:57'),
(164, 'چک لیست بعد از نصب ویندوز کلاینت ها', 'check list windows', '2026-01-18', NULL, 0, NULL, NULL, 2, 16, NULL, '2026-01-18 05:38:47', '2026-01-18 05:38:47'),
(165, 'وب سرور جنتک', 'Genetek Werb Server Address آدرس وب سرور جنتک دوربین', '2026-01-19', NULL, 0, NULL, NULL, 3, 16, NULL, '2026-01-19 11:19:59', '2026-01-19 11:19:59'),
(166, 'سرور pbx ', 'آدرس pbx Yeastar voip سرور ویپ', '2026-01-24', NULL, 0, NULL, NULL, 5, 16, NULL, '2026-01-24 11:57:10', '2026-01-24 11:57:10'),
(167, 'فونت همداد', 'hamdad font problem مشکل فونت همداد', '2026-01-25', NULL, 0, NULL, NULL, 7, 16, NULL, '2026-01-25 11:22:29', '2026-01-25 11:22:29'),
(168, 'عدم مشاهده دایرکتوری FTP', 'اتصال موفق به ftp ولی ناتوان در دریافت لیست دایرکتوری', '2026-01-26', NULL, 0, NULL, NULL, 7, 16, NULL, '2026-01-26 04:33:15', '2026-01-26 04:33:15'),
(169, 'voip ip', '', '2026-01-26', NULL, 0, NULL, NULL, 1, 16, NULL, '2026-01-26 10:43:42', '2026-01-26 10:43:42'),
(170, 'نصب اندروید روی ماشین مجازی', 'android bliss x86 vmware', '2026-02-03', NULL, 0, NULL, NULL, 6, 16, NULL, '2026-02-03 07:52:07', '2026-02-03 07:52:07'),
(171, 'اتصال ماشین مجازی به محیط eve-ng', 'eveng ', '2026-02-05', NULL, 0, NULL, NULL, 6, 16, NULL, '2026-02-05 04:48:07', '2026-02-05 04:48:07'),
(172, 'ip static Linux', 'تنظیم ای پی استاتیک دستی روی لینوکس اوبونتو', '2026-02-21', NULL, 0, NULL, NULL, 6, 16, NULL, '2026-02-21 10:46:31', '2026-02-21 10:46:31'),
(173, 'نصب jitsi روی شبکه لوکال', 'jitsi meet local', '2026-02-21', NULL, 0, NULL, NULL, 6, 16, NULL, '2026-02-21 10:57:20', '2026-02-21 10:57:20'),
(174, 'ip niroogah', '', '2026-03-08', NULL, 0, NULL, NULL, 3, 16, NULL, '2026-03-08 04:43:19', '2026-03-08 04:43:19'),
(175, 'فعال کردن کاربر root', 'فعال کردن کاربر روت لینوکس', '2026-03-12', NULL, 0, NULL, NULL, 6, 16, NULL, '2026-03-12 09:00:06', '2026-03-12 09:00:06'),
(176, 'تبدیل vhdx به vmdk', 'تبدیل هارد مجازی hyper v به vmware', '2026-03-12', NULL, 0, NULL, NULL, 6, 16, NULL, '2026-03-12 10:19:36', '2026-03-12 10:19:36'),
(177, 'تغییر ip لینوکس', '', '2026-03-12', NULL, 0, NULL, NULL, 1, 16, NULL, '2026-03-12 10:24:34', '2026-03-12 10:24:34'),
(178, 'دستورات لینوکس', '', '2026-03-12', NULL, 0, NULL, NULL, 6, 16, NULL, '2026-03-12 10:28:25', '2026-03-12 11:10:40'),
(179, 'نصب dual boot', 'imagex.exe ', '2026-03-12', NULL, 0, NULL, NULL, 2, 16, NULL, '2026-03-12 11:00:35', '2026-03-12 11:00:35'),
(180, 'دستورات ویندوز', '', '2026-03-12', NULL, 0, NULL, NULL, 2, 16, NULL, '2026-03-12 11:03:33', '2026-03-12 11:03:33'),
(181, 'راه اندازی dmvpn', 'سوییچ سیسکو راه اندازی dmvpn eigrp nhrp', '2026-03-12', NULL, 0, NULL, NULL, 1, 16, NULL, '2026-03-12 11:12:36', '2026-03-12 11:12:36');

-- --------------------------------------------------------

--
-- Table structure for table `task_user`
--

CREATE TABLE `task_user` (
  `id` int(11) NOT NULL,
  `task_id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci ROW_FORMAT=DYNAMIC;

--
-- Dumping data for table `task_user`
--

INSERT INTO `task_user` (`id`, `task_id`, `user_id`, `created_at`) VALUES
(34, 136, 24, '2025-11-26 11:20:16'),
(35, 136, 16, '2025-11-26 11:20:16'),
(36, 137, 25, '2025-11-26 12:04:24'),
(37, 137, 24, '2025-11-26 12:04:24'),
(38, 137, 16, '2025-11-26 12:04:24'),
(39, 138, 25, '2025-11-27 04:31:22'),
(40, 138, 24, '2025-11-27 04:31:22'),
(41, 138, 16, '2025-11-27 04:31:22'),
(42, 139, 25, '2025-11-27 04:47:41'),
(43, 139, 24, '2025-11-27 04:47:41'),
(44, 139, 16, '2025-11-27 04:47:41'),
(49, 144, 25, '2025-11-27 05:27:53'),
(50, 144, 24, '2025-11-27 05:27:53'),
(51, 144, 16, '2025-11-27 05:27:53'),
(55, 146, 25, '2025-11-27 05:30:07'),
(56, 146, 24, '2025-11-27 05:30:07'),
(57, 146, 16, '2025-11-27 05:30:07'),
(58, 147, 25, '2025-11-27 05:31:10'),
(59, 147, 24, '2025-11-27 05:31:10'),
(60, 147, 16, '2025-11-27 05:31:10'),
(61, 148, 25, '2025-11-27 05:32:42'),
(62, 148, 24, '2025-11-27 05:32:42'),
(63, 148, 16, '2025-11-27 05:32:42'),
(64, 149, 25, '2025-11-27 05:36:32'),
(65, 149, 24, '2025-11-27 05:36:32'),
(66, 149, 16, '2025-11-27 05:36:32'),
(67, 150, 25, '2025-11-27 05:37:37'),
(68, 150, 24, '2025-11-27 05:37:37'),
(69, 150, 16, '2025-11-27 05:37:37'),
(70, 151, 25, '2025-11-27 05:40:49'),
(71, 151, 24, '2025-11-27 05:40:49'),
(72, 151, 16, '2025-11-27 05:40:49'),
(73, 152, 25, '2025-12-08 10:28:55'),
(74, 152, 24, '2025-12-08 10:28:55'),
(75, 152, 16, '2025-12-08 10:28:55'),
(76, 153, 25, '2025-12-13 04:34:29'),
(77, 153, 24, '2025-12-13 04:34:29'),
(78, 153, 16, '2025-12-13 04:34:29'),
(79, 154, 25, '2025-12-16 08:40:49'),
(80, 154, 24, '2025-12-16 08:40:49'),
(81, 154, 16, '2025-12-16 08:40:49'),
(82, 155, 25, '2025-12-17 04:37:30'),
(83, 155, 24, '2025-12-17 04:37:30'),
(84, 155, 16, '2025-12-17 04:37:30'),
(85, 156, 25, '2025-12-17 07:24:40'),
(86, 156, 24, '2025-12-17 07:24:40'),
(87, 156, 16, '2025-12-17 07:24:40'),
(88, 157, 25, '2025-12-17 08:53:43'),
(89, 157, 24, '2025-12-17 08:53:43'),
(90, 157, 16, '2025-12-17 08:53:43'),
(91, 158, 25, '2025-12-17 08:56:58'),
(92, 158, 24, '2025-12-17 08:56:58'),
(93, 158, 16, '2025-12-17 08:56:58'),
(94, 159, 25, '2025-12-18 06:30:04'),
(95, 159, 24, '2025-12-18 06:30:04'),
(96, 159, 16, '2025-12-18 06:30:04'),
(97, 160, 16, '2026-01-08 04:57:36'),
(98, 161, 16, '2026-01-08 05:27:35'),
(99, 162, 16, '2026-01-08 05:28:59'),
(100, 163, 16, '2026-01-08 11:41:57'),
(101, 164, 25, '2026-01-18 05:38:47'),
(102, 164, 24, '2026-01-18 05:38:47'),
(103, 164, 16, '2026-01-18 05:38:47'),
(104, 165, 25, '2026-01-19 11:19:59'),
(105, 165, 24, '2026-01-19 11:19:59'),
(106, 165, 16, '2026-01-19 11:19:59'),
(107, 166, 25, '2026-01-24 11:57:10'),
(108, 166, 24, '2026-01-24 11:57:10'),
(109, 166, 16, '2026-01-24 11:57:10'),
(110, 167, 25, '2026-01-25 11:22:29'),
(111, 167, 24, '2026-01-25 11:22:29'),
(112, 167, 16, '2026-01-25 11:22:29'),
(113, 168, 16, '2026-01-26 04:33:15'),
(114, 169, 16, '2026-01-26 10:43:42'),
(115, 170, 25, '2026-02-03 07:52:07'),
(116, 170, 24, '2026-02-03 07:52:07'),
(117, 170, 16, '2026-02-03 07:52:07'),
(118, 171, 16, '2026-02-05 04:48:07'),
(119, 172, 16, '2026-02-21 10:46:31'),
(120, 173, 16, '2026-02-21 10:57:20'),
(121, 174, 16, '2026-03-08 04:43:19'),
(122, 175, 25, '2026-03-12 09:00:06'),
(123, 175, 24, '2026-03-12 09:00:06'),
(124, 175, 16, '2026-03-12 09:00:06'),
(125, 176, 16, '2026-03-12 10:19:36'),
(126, 177, 16, '2026-03-12 10:24:34'),
(127, 178, 16, '2026-03-12 10:28:25'),
(128, 179, 16, '2026-03-12 11:00:35'),
(129, 180, 16, '2026-03-12 11:03:33'),
(130, 181, 16, '2026-03-12 11:12:36');

-- --------------------------------------------------------

--
-- Table structure for table `test`
--

CREATE TABLE `test` (
  `id` int(11) NOT NULL,
  `name` varchar(20) NOT NULL,
  `e_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

-- --------------------------------------------------------

--
-- Table structure for table `test2`
--

CREATE TABLE `test2` (
  `id` int(11) NOT NULL,
  `id_test` int(11) NOT NULL,
  `tozehat` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

-- --------------------------------------------------------

--
-- Table structure for table `timings`
--

CREATE TABLE `timings` (
  `id` int(11) NOT NULL,
  `name` varchar(100) NOT NULL,
  `label` varchar(255) DEFAULT NULL,
  `color` varchar(20) DEFAULT 'default',
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci ROW_FORMAT=DYNAMIC;

--
-- Dumping data for table `timings`
--

INSERT INTO `timings` (`id`, `name`, `label`, `color`, `created_at`, `updated_at`) VALUES
(0, 'free', 'نامحدود', 'info', '2025-11-06 08:04:22', '2025-11-06 08:29:23'),
(1, 'prestart', 'شروع نشده', 'warning', '2025-11-05 10:05:24', '2025-11-06 06:30:10'),
(2, 'started', 'شروع شده', 'success', '2025-11-05 10:06:32', '2025-11-06 06:30:15'),
(3, 'expired', 'منقضی', 'danger', '2025-11-05 10:07:25', '2025-11-06 08:30:27');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `name` varchar(100) NOT NULL,
  `email` varchar(150) DEFAULT NULL,
  `password` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci ROW_FORMAT=DYNAMIC;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `name`, `email`, `password`, `created_at`, `updated_at`) VALUES
(16, 'mahdi', 'mahddi92@gmail.com', '$2y$12$X2zyEsk7rNu7uD9bni1p7ecN7UrMuEzIhsLPrI0IEMOnotU33AlsO', '2025-11-15 06:34:22', '2025-11-15 06:34:22'),
(24, 'badri', NULL, '$2y$10$hOhDBG/fVH32.Twklq7L1emy8X5ObOH.h8yPvBuh.o1LHj61KAwHO', '2025-11-22 11:02:59', '2025-11-22 11:02:59'),
(25, '1', NULL, '$2y$10$xLEyITmZLSJdRL1psPfAF.lcPT.VHBHS4OA5/h0RxMoFyCmTnyEly', '2025-11-26 12:02:09', '2025-11-26 12:02:09');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- Indexes for table `docs`
--
ALTER TABLE `docs`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- Indexes for table `events`
--
ALTER TABLE `events`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- Indexes for table `hijri`
--
ALTER TABLE `hijri`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- Indexes for table `hijri_months`
--
ALTER TABLE `hijri_months`
  ADD UNIQUE KEY `year_2` (`year`),
  ADD KEY `year` (`year`);

--
-- Indexes for table `jalali`
--
ALTER TABLE `jalali`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- Indexes for table `jobs`
--
ALTER TABLE `jobs`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD KEY `taskid` (`task_id`) USING BTREE;

--
-- Indexes for table `miladi`
--
ALTER TABLE `miladi`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- Indexes for table `priorities`
--
ALTER TABLE `priorities`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- Indexes for table `statuses`
--
ALTER TABLE `statuses`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- Indexes for table `tasks`
--
ALTER TABLE `tasks`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD KEY `statusid` (`statusid`) USING BTREE,
  ADD KEY `categoryid` (`categoryid`) USING BTREE,
  ADD KEY `ownerid` (`ownerid`) USING BTREE,
  ADD KEY `parent_id` (`parent_id`) USING BTREE;

--
-- Indexes for table `task_user`
--
ALTER TABLE `task_user`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD UNIQUE KEY `unique_relation` (`task_id`,`user_id`) USING BTREE,
  ADD KEY `user_id` (`user_id`) USING BTREE;

--
-- Indexes for table `test`
--
ALTER TABLE `test`
  ADD PRIMARY KEY (`id`),
  ADD KEY `id` (`id`);

--
-- Indexes for table `test2`
--
ALTER TABLE `test2`
  ADD PRIMARY KEY (`id`),
  ADD KEY `id_test` (`id_test`);

--
-- Indexes for table `timings`
--
ALTER TABLE `timings`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD UNIQUE KEY `email` (`email`) USING BTREE;

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `categories`
--
ALTER TABLE `categories`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `docs`
--
ALTER TABLE `docs`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=149;

--
-- AUTO_INCREMENT for table `events`
--
ALTER TABLE `events`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=694;

--
-- AUTO_INCREMENT for table `hijri`
--
ALTER TABLE `hijri`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=58;

--
-- AUTO_INCREMENT for table `jalali`
--
ALTER TABLE `jalali`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=141;

--
-- AUTO_INCREMENT for table `jobs`
--
ALTER TABLE `jobs`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=390;

--
-- AUTO_INCREMENT for table `miladi`
--
ALTER TABLE `miladi`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=60;

--
-- AUTO_INCREMENT for table `priorities`
--
ALTER TABLE `priorities`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- AUTO_INCREMENT for table `statuses`
--
ALTER TABLE `statuses`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `tasks`
--
ALTER TABLE `tasks`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=182;

--
-- AUTO_INCREMENT for table `task_user`
--
ALTER TABLE `task_user`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=131;

--
-- AUTO_INCREMENT for table `test`
--
ALTER TABLE `test`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `test2`
--
ALTER TABLE `test2`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=112;

--
-- AUTO_INCREMENT for table `timings`
--
ALTER TABLE `timings`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=26;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `tasks`
--
ALTER TABLE `tasks`
  ADD CONSTRAINT `parent_id` FOREIGN KEY (`parent_id`) REFERENCES `tasks` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `tasks_ibfk_1` FOREIGN KEY (`statusid`) REFERENCES `statuses` (`id`) ON DELETE SET NULL ON UPDATE CASCADE,
  ADD CONSTRAINT `tasks_ibfk_2` FOREIGN KEY (`categoryid`) REFERENCES `categories` (`id`) ON DELETE SET NULL ON UPDATE CASCADE,
  ADD CONSTRAINT `tasks_ibfk_4` FOREIGN KEY (`ownerid`) REFERENCES `users` (`id`) ON DELETE SET NULL ON UPDATE CASCADE;

--
-- Constraints for table `task_user`
--
ALTER TABLE `task_user`
  ADD CONSTRAINT `task_user_ibfk_1` FOREIGN KEY (`task_id`) REFERENCES `tasks` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `task_user_ibfk_2` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `test2`
--
ALTER TABLE `test2`
  ADD CONSTRAINT `id_test` FOREIGN KEY (`id_test`) REFERENCES `test` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
